#include "messages.h"

#define iSrciptMessagesChildLen    5
#define iMessagesChildLen    2

static const CHAR AttributeID[][iMessagesChildLen][256] = {
	{ "0x0000", "状态表情图像"},
	{ "0x0001", "战斗模型"},
	{ "0x0002", "地图模型"},
	{ "0x0003", "名字"},
	{ "0x0004", "可否攻击全体"},
	{ "0x0005", "未知"},
	{ "0x0006", "等级"},
	{ "0x0007", "体力最大值"},
	{ "0x0008", "真气最大值"},
	{ "0x0009", "体力"},
	{ "0x000a", "真气"},
	{ "0x000B", "头戴"},
	{ "0x000C", "披挂"},
	{ "0x000D", "身穿"},
	{ "0x000E", "手持"},
	{ "0x000F", "脚穿"},
	{ "0x0010", "配戴"},
	{ "0x0011", "武术"},
	{ "0x0012", "灵力"},
	{ "0x0013", "防御"},
	{ "0x0014", "身法"},
	{ "0x0015", "吉运"},
	{ "0x0016", "毒抗"},
	{ "0x0017", "风抗"},
	{ "0x0018", "雷抗"},
	{ "0x0019", "水抗"},
	{ "0x001a", "火抗"},
	{ "0x001b", "土抗"},
	{ "0x001c", "巫抗？"},
	{ "0x001d", "物抗？"},
	{ "0x001e", "绝技加成？圆梦版的受援2"},
	{ "0x001f", "受援"},
	{ "0x0020", "仙术1组"},
	{ "0x0021", "仙术2组"},
	{ "0x0022", "仙术3组"},
	{ "0x0023", "仙术4组"},
	{ "0x0024", "仙术5组"},
	{ "0x0025", "仙术6组"},
	{ "0x0026", "仙术7组"},
	{ "0x0027", "仙术8组"},
	{ "0x0028", "仙术9组"},
	{ "0x0029", "仙术10组"},
	{ "0x002a", "仙术11组"},
	{ "0x002b", "仙术12组"},
	{ "0x002c", "仙术13组"},
	{ "0x002d", "仙术14组"},
	{ "0x002e", "仙术15组"},
	{ "0x002f", "仙术16组"},
	{ "0x0030", "仙术17组"},
	{ "0x0031", "仙术18组"},
	{ "0x0032", "仙术19组"},
	{ "0x0033", "仙术20组"},
	{ "0x0034", "仙术21组"},
	{ "0x0035", "仙术22组"},
	{ "0x0036", "仙术23组"},
	{ "0x0037", "仙术24组"},
	{ "0x0038", "仙术25组"},
	{ "0x0039", "仙术26组"},
	{ "0x003a", "仙术27组"},
	{ "0x003b", "仙术28组"},
	{ "0x003c", "仙术29组"},
	{ "0x003d", "仙术30组"},
	{ "0x003e", "仙术31组"},
	{ "0x003f", "仙术32组"},
	{ "0x0040", "单方向行走帧数"},
	{ "0x0041", "合体法术"},
	{ "0x0042", "精力最大值？圆梦版的力道"},
	{ "0x0043", "精力？圆梦版的气劲"},
	{ "0x0044", "阵亡音效"},
	{ "0x0045", "普攻音效"},
	{ "0x0046", "武器音效"},
	{ "0x0047", "倍攻音效"},
	{ "0x0048", "施法音效"},
	{ "0x0049", "格挡音效"},
	{ "0x004A", "濒亡音效"},
};

static const CHAR BattleResultID[][iMessagesChildLen][256] = {
	{ "0x0000", "逃离战斗" },
	{ "0x0001", "我方全灭" },
	{ "0x0003", "敌方全灭" },
	{ "0xffff", "逃离战斗" }
};

static const CHAR BattleSpriteID[][iMessagesChildLen][256] = {
	{ "0x0000", "李逍遥" },
	{ "0x0001", "赵灵儿" },
	{ "0x0002", "林月如·持刀" },
	{ "0x0003", "巫后" },
	{ "0x0004", "阿奴·执杖" },
	{ "0x0005", "赵灵儿·灵蛇" },
	{ "0x0006", "林月如·持鞭" },
	{ "0x0007", "阿奴·执刀" },
	{ "0x0008", "盖罗娇" },
	{ "0x0009", "赵灵儿·祭司" },
	{ "0x000a", "武神" },
	{ "0x000b", "天剑" },
	{ "0x000c", "雪妖" },
	{ "0x000d", "山神" },
	{ "0x000e", "风神" },
	{ "0x000f", "酒神" },
	{ "0x0010", "雷神" },
	{ "0x0011", "剑神" },
	{ "0x0012", "火神" }
};

static const CHAR BodyPartID[][iMessagesChildLen][256] = {
	{ "0x0000", "全部" },
	{ "0x0001", "头部" },
	{ "0x0002", "身体" },
	{ "0x0003", "肩部" },
	{ "0x0004", "武器" },
	{ "0x0005", "脚部" },
	{ "0x0006", "配戴" },
	{ "0x0007", "未知" },
	{ "0x0008", "未知" },
	{ "0x0009", "未知" },
	{ "0x000a", "未知" },
	{ "0x000b", "头部" },
	{ "0x000c", "身体" },
	{ "0x000d", "披挂" },
	{ "0x000e", "武器" },
	{ "0x000f", "脚部" },
	{ "0x0010", "配戴" },
	{ "0x0011", "额外" }
};

static const CHAR CDID[][iMessagesChildLen][256] = {
	{ "0x0000", "未知" },
	{ "0x0001", "未知" },
	{ "0x0002", "情怨" },
	{ "0x0003", "蝶舞春园" },
	{ "0x0004", "雨" },
	{ "0x0005", "白河寒秋" },
	{ "0x0006", "桃花幻梦" },
	{ "0x0007", "云谷鹤峰" },
	{ "0x0008", "蝶恋" },
	{ "0x0009", "比武招亲" },
	{ "0x000a", "梦中大侠" },
	{ "0x000b", "拜月欺天" },
	{ "0x000c", "君莫悲" },
	{ "0x000d", "再续未了缘" },
	{ "0xffff", "当前?" }
};

static const CHAR CharacterID[][iMessagesChildLen][256] = {
	{ "0x0000", "全体" },
	{ "0x0001", "李逍遥" },
	{ "0x0002", "赵灵儿" },
	{ "0x0003", "林月如" },
	{ "0x0004", "巫后" },
	{ "0x0005", "阿奴" },
	{ "0x0006", "盖罗娇" }
};

static const CHAR ConditionID[][iMessagesChildLen][256] = {
	{ "0x0000", "疯魔" },
	{ "0x0001", "定身" },
	{ "0x0002", "昏睡" },
	{ "0x0003", "咒封" },
	{ "0x0004", "死者继续攻击" },
	{ "0x0005", "普通攻击加强" },
	{ "0x0006", "防御加强" },
	{ "0x0007", "身法加强" },
	{ "0x0008", "两次攻击" }
};

static const CHAR DirectionID[][iMessagesChildLen][16] = {
	{ "0x0000", "西" },
	{ "0x0001", "北" },
	{ "0x0002", "东" },
	{ "0x0003", "南" },
	{ "0xFFFF", "方向不变" }
};

static const CHAR EnemyDataID[][iMessagesChildLen][16] = {
	{ "0x0000", "无" },
	{ "0x0001", "史莱姆" },
	{ "0x0002", "灯笼" },
	{ "0x0003", "黑毛球" },
	{ "0x0004", "烂香菇" },
	{ "0x0005", "凤梨小妖" },
	{ "0x0006", "蜜蜂" },
	{ "0x0007", "蛹 " },
	{ "0x0008", "小鱼" },
	{ "0x0009", "血口虫" },
	{ "0x000a", "开膛鬼" },
	{ "0x000b", "半截僵尸" },
	{ "0x000c", "菜刀婆婆" },
	{ "0x000d", "小土鬼" },
	{ "0x000e", "跳蚤" },
	{ "0x000f", "小蜘蛛" },
	{ "0x0010", "石鬼头" },
	{ "0x0011", "镰刀鼬" },
	{ "0x0012", "酒瓮" },
	{ "0x0013", "芒刺鬼" },
	{ "0x0014", "猪头人" },
	{ "0x0015", "小雷公" },
	{ "0x0016", "僵尸" },
	{ "0x0017", "跳跳蛙" },
	{ "0x0018", "大手" },
	{ "0x0019", "怪老子" },
	{ "0x001a", "树根" },
	{ "0x001b", "小独角" },
	{ "0x001c", "青鬼" },
	{ "0x001d", "蜥蜴" },
	{ "0x001e", "红鬼" },
	{ "0x001f", "公背婆" },
	{ "0x0020", "傻仔龟" },
	{ "0x0021", "短腿章鱼" },
	{ "0x0022", "大蝌蚪" },
	{ "0x0023", "蚌壳" },
	{ "0x0024", "飞头" },
	{ "0x0025", "肥肥" },
	{ "0x0026", "六脚蜘蛛" },
	{ "0x0027", "伏地罗汉" },
	{ "0x0028", "海螺女" },
	{ "0x0029", "魔兽武士" },
	{ "0x002a", "连体妖" },
	{ "0x002b", "刑天" },
	{ "0x002c", "扫把" },
	{ "0x002d", "黄衣刀僧" },
	{ "0x002e", "罗汉腿" },
	{ "0x002f", "醉罗汉" },
	{ "0x0030", "血云雾" },
	{ "0x0031", "哈将" },
	{ "0x0032", "金锤武士" },
	{ "0x0033", "巨斧武士" },
	{ "0x0034", "角力士" },
	{ "0x0035", "枪卒" },
	{ "0x0036", "红衣喇嘛" },
	{ "0x0037", "白无常" },
	{ "0x0038", "灰衣喇嘛" },
	{ "0x0039", "刀手" },
	{ "0x003a", "铁叉牛头" },
	{ "0x003b", "猩猩" },
	{ "0x003c", "双节棍苗" },
	{ "0x003d", "小苗女" },
	{ "0x003e", "小巫师" },
	{ "0x003f", "长鞭苗女" },
	{ "0x0040", "蛟龙" },
	{ "0x0041", "树妖" },
	{ "0x0042", "麒麟" },
	{ "0x0043", "凤凰" },
	{ "0x0044", "金蟾" },
	{ "0x0045", "牛鬼" },
	{ "0x0046", "瘟神" },
	{ "0x0047", "蝶精彩依" },
	{ "0x0048", "狐狸精" },
	{ "0x0049", "牡丹精" },
	{ "0x004a", "玩蛇女" },
	{ "0x004b", "僵尸王" },
	{ "0x004c", "赤鬼王" },
	{ "0x004d", "木灵道士" },
	{ "0x004e", "剑护院" },
	{ "0x004f", "锤护院" },
	{ "0x0050", "小双钩" },
	{ "0x0051", "女飞贼" },
	{ "0x0051", "女飞贼1" },
	{ "0x0052", "林月如一" },
	{ "0x0053", "暗器手" },
	{ "0x0054", "智杖和尚" },
	{ "0x0055", "林月如二" },
	{ "0x0056", "食人兽" },
	{ "0x0057", "胖苗" },
	{ "0x0058", "半人蛇" },
	{ "0x0059", "赤色小蛇" },
	{ "0x005a", "绿色小蛇" },
	{ "0x005b", "老虎" },
	{ "0x005c", "五毒巨蝎" },
	{ "0x005d", "五毒巨蛇" },
	{ "0x005e", "五毒蜈蚣" },
	{ "0x005f", "青兽人" },
	{ "0x0060", "剑老头" },
	{ "0x0061", "苗人拳" },
	{ "0x0063", "黑蜘蛛精" },
	{ "0x0064", "绿叶小妖" },
	{ "0x0065", "金蟾鬼母" },
	{ "0x0066", "盖罗娇1" },
	{ "0x0067", "蛇女灵儿" },
	{ "0x0068", "鸟人" },
	{ "0x0069", "僵尸兵A" },
	{ "0x006a", "僵尸兵B" },
	{ "0x006b", "僵尸兵C" },
	{ "0x006c", "半人树妖" },
	{ "0x006d", "小树妖" },
	{ "0x006e", "尖头树妖" },
	{ "0x006f", "尖嘴魔兵" },
	{ "0x0070", "铁棍魔兵" },
	{ "0x0071", "黑衣道众" },
	{ "0x0072", "狒狒" },
	{ "0x0073", "五彩蜘蛛" },
	{ "0x0074", "紫凤鸟" },
	{ "0x0075", "小毒蝎" },
	{ "0x0076", "赤蜈蚣" },
	{ "0x0077", "石长老" },
	{ "0x0078", "食火蟾" },
	{ "0x0079", "明王" },
	{ "0x007a", "九头蛇" },
	{ "0x007b", "雷龙" },
	{ "0x007c", "黑巫师" },
	{ "0x007d", "黑苗祭司" },
	{ "0x007e", "智修大师" },
	{ "0x007f", "林天南" },
	{ "0x0080", "黑衣女贼" },
	{ "0x0081", "苗枪卒" },
	{ "0x0082", "巫王侍卫" },
	{ "0x0083", "天鬼皇" },
	{ "0x0084", "绿叶妖精" },
	{ "0x0085", "火蛟龙" },
	{ "0x0086", "土蛟龙" },
	{ "0x0087", "黑凤凰" },
	{ "0x0088", "红史莱姆" },
	{ "0x0089", "紫兽人" },
	{ "0x008a", "土蜘蛛" },
	{ "0x008b", "绿食火蟾" },
	{ "0x008c", "蓝食火蟾" },
	{ "0x008d", "毒神龙" },
	{ "0x008e", "金神龙" },
	{ "0x008f", "土神龙" },
	{ "0x0090", "火神龙" },
	{ "0x0091", "冰神龙" },
	{ "0x0092", "风神龙" },
	{ "0x0093", "雷神龙" },
	{ "0x0094", "石长老1" },
	{ "0x0095", "拜月教主" },
	{ "0x0096", "八头蛇" },
	{ "0x0097", "苗人拳1" },
	{ "0x0098", "苗枪卒1" },
	{ "0x0099", "紫九头蛇" },
};

static const CHAR EnemyScriptID[][iMessagesChildLen][16] = {
	{ "0x0000", "战前脚本" },
	{ "0x0001", "战后脚本" },
	{ "0x0002", "战时脚本" }
};

static const CHAR FaceID[][iMessagesChildLen][128] = {
	{ "0x0000", "无人像" },
	{ "0x0001", "李逍遥" },
	{ "0x0002", "李逍遥说话" },
	{ "0x0003", "李逍遥乐" },
	{ "0x0004", "李逍遥愁" },
	{ "0x0005", "李逍遥怒" },
	{ "0x0006", "李逍遥悠" },
	{ "0x0007", "李逍遥奇" },
	{ "0x0008", "李逍遥惑" },
	{ "0x0009", "李逍遥认真" },
	{ "0x000a", "李逍遥讶" },
	{ "0x000b", "赵灵儿" },
	{ "0x000c", "赵灵儿说话" },
	{ "0x000d", "赵灵儿流泪" },
	{ "0x000e", "赵灵儿乐" },
	{ "0x000f", "赵灵儿愁" },
	{ "0x0010", "赵灵儿怒" },
	{ "0x0011", "赵灵儿认真" },
	{ "0x0012", "赵灵儿喝" },
	{ "0x0013", "赵灵儿羞" },
	{ "0x0014", "无人像" },
	{ "0x0015", "林月如" },
	{ "0x0016", "林月如不屑" },
	{ "0x0017", "林月如说话" },
	{ "0x0018", "林月如认真" },
	{ "0x0019", "林月如目光游移" },
	{ "0x001a", "林月如流泪" },
	{ "0x001b", "阿奴" },
	{ "0x001c", "阿奴说话" },
	{ "0x001d", "阿奴乐" },
	{ "0x001e", "阿奴怒喝" },
	{ "0x001f", "阿奴呆" },
	{ "0x0020", "阿奴笑骂" },
	{ "0x0021", "丁秀兰" },
	{ "0x0022", "丁秀兰忧" },
	{ "0x0023", "丁秀兰欲语还休" },
	{ "0x0024", "唐钰" },
	{ "0x0025", "酒剑仙" },
	{ "0x0026", "路人甲~" },
	{ "0x0027", "张四哥" },
	{ "0x0028", "刘晋元" },
	{ "0x0029", "女飞贼(姬三娘)" },
	{ "0x002a", "姬三娘" },
	{ "0x002b", "天鬼皇" },
	{ "0x002c", "盖罗娇" },
	{ "0x002d", "白苗组长" },
	{ "0x002e", "阿桃" },
	{ "0x002f", "姜婉儿" },
	{ "0x0030", "彩依" },
	{ "0x0031", "彩依流泪" },
	{ "0x0032", "韩梦慈" },
	{ "0x0033", "韩梦慈忧" },
	{ "0x0034", "丁香兰" },
	{ "0x0035", "毒娘子" },
	{ "0x0036", "姥姥" },
	{ "0x0037", "李大娘" },
	{ "0x0038", "莺莺夫人" },
	{ "0x0039", "蛇妖男" },
	{ "0x003a", "姜太师叔" },
	{ "0x003b", "胖苗" },
	{ "0x003c", "石长老" },
	{ "0x003d", "赤鬼王" },
	{ "0x003e", "扬州太守" },
	{ "0x003f", "独孤剑圣" },
	{ "0x0040", "林天南" },
	{ "0x0041", "韩医仙" },
	{ "0x0042", "骆员外" },
	{ "0x0043", "云姨" },
	{ "0x0044", "宋贺文" },
	{ "0x0045", "书中仙" },
	{ "0x0046", "假巫王" },
	{ "0x0047", "真巫王" },
	{ "0x0048", "灵月宫主" },
	{ "0x0049", "巫后" },
	{ "0x004a", "小灵儿" },
	{ "0x004b", "年轻姥姥" },
	{ "0x004c", "阿香" },
	{ "0x004d", "姥姥垂危" },
	{ "0x004e", "无人像" },
	{ "0x004f", "无人像" },
	{ "0x0050", "拜月教主(十年前)" },
	{ "0x0051", "拜月教主" },
	{ "0x0052", "圣姑" },
	{ "0x0053", "金蟾鬼母" },
	{ "0x0054", "金蟾鬼母(妖)" },
	{ "0x0055", "小逍遥" },
	{ "0x0056", "小石头" },
	{ "0x0057", "王小虎" },
	{ "0x0058", "圣·灵儿" },
	{ "0x0059", "圣·灵儿喜" },
	{ "0x005a", "灵儿初现形" },
	{ "0x005b", "灵儿完全觉醒" }
};

static const CHAR MagicDataID[][iMessagesChildLen][16] = {
	{ "0x0000", "风咒" },
	{ "0x0001", "雷咒" },
	{ "0x0002", "冰咒" },
	{ "0x0003", "火术" },
	{ "0x0004", "土咒" },
	{ "0x0005", "旋风咒" },
	{ "0x0006", "五雷咒" },
	{ "0x0007", "玄冰咒" },
	{ "0x0008", "炎咒" },
	{ "0x0009", "飞岩术" },
	{ "0x000A", "御剑术" },
	{ "0x000B", "剑气" },
	{ "0x000C", "一阳指" },
	{ "0x000D", "七绝剑气" },
	{ "0x000E", "炎杀咒" },
	{ "0x000F", "弦月斩" },
	{ "0x0010", "斩龙决" },
	{ "0x0011", "炼狱真火" },
	{ "0x0012", "斩魔刀" },
	{ "0x0013", "武神" },
	{ "0x0014", "心剑合一" },
	{ "0x0015", "天剑" },
	{ "0x0016", "雪妖" },
	{ "0x0017", "风雪冰天" },
	{ "0x0018", "御蜂术" },
	{ "0x0019", "山神" },
	{ "0x001A", "泰山压顶" },
	{ "0x001B", "天女散花" },
	{ "0x001C", "鞭击" },
	{ "0x001D", "地裂天崩" },
	{ "0x001E", "万剑决" },
	{ "0x001F", "冰心决" },
	{ "0x0020", "无" },
	{ "0x0021", "气疗术" },
	{ "0x0022", "凝神归元" },
	{ "0x0023", "观音咒" },
	{ "0x0024", "还魂咒" },
	{ "0x0025", "赎魂" },
	{ "0x0026", "净衣咒" },
	{ "0x0027", "金刚咒" },
	{ "0x0028", "真元护体" },
	{ "0x0029", "天罡战气" },
	{ "0x002A", "三昧真火" },
	{ "0x002B", "气剑指" },
	{ "0x002C", "炼狱爪" },
	{ "0x002D", "血魔神功" },
	{ "0x002E", "五气朝元" },
	{ "0x002F", "梦蛇" },
	{ "0x0030", "三尸咒" },
	{ "0x0031", "暗器" },
	{ "0x0032", "狂风术" },
	{ "0x0033", "元灵归心术" },
	{ "0x0034", "灵血咒" },
	{ "0x0035", "铜钱镖" },
	{ "0x0036", "天师符法" },
	{ "0x0037", "御剑伏魔" },
	{ "0x0038", "风灵符法" },
	{ "0x0039", "雷灵符法" },
	{ "0x003A", "水灵符法" },
	{ "0x003B", "火灵符法" },
	{ "0x003C", "土灵符法" },
	{ "0x003D", "气吞天下" },
	{ "0x003E", "瘴气" },
	{ "0x003F", "万蛊蚀天" },
	{ "0x0040", "天雷破" },
	{ "0x0041", "爆炸蛊" },
	{ "0x0042", "回梦" },
	{ "0x0043", "夺魂" },
	{ "0x0044", "鬼降" },
	{ "0x0045", "镇天鼎" },
	{ "0x0046", "咒蛇" },
	{ "0x0047", "万蚁食象" },
	{ "0x0048", "风卷残云" },
	{ "0x0049", "风神" },
	{ "0x004A", "气魔焰" },
	{ "0x004B", "酒神" },
	{ "0x004C", "雷神" },
	{ "0x004D", "狂雷" },
	{ "0x004E", "灭绝一击" },
	{ "0x004F", "爆炸" },
	{ "0x0050", "无" },
	{ "0x0051", "无" },
	{ "0x0052", "魔掌天下" },
	{ "0x0053", "佛法无边" },
	{ "0x0054", "灵葫咒" },
	{ "0x0055", "火龙掌" },
	{ "0x0056", "合体气功" },
	{ "0x0057", "气功" },
	{ "0x0058", "弦月斩1" },
	{ "0x0059", "御剑伏魔1" },
	{ "0x005A", "剑神" },
	{ "0x005B", "毒吞天下" },
	{ "0x005C", "风雪冰天1" },
	{ "0x005D", "剑气斩" },
	{ "0x005E", "火神" },
	{ "0x005F", "醉仙望月步" },
	{ "0x0060", "投掷" },
	{ "0x0061", "仙风云体术" },
	{ "0x0062", "飞龙探云手" },
	{ "0x0063", "金蝉脱壳" },
	{ "0x0064", "乾坤一掷" },
	{ "0x0065", "大咒蛇" },
	{ "0x0066", "腥风血雨" },
	{ "0x0067", "群魔乱舞" }
};

static const CHAR MovieID[][iMessagesChildLen][32] = {
	{ "0x0000", "坠入血池" },
	{ "0x0001", "酒剑仙月下传剑" },
	{ "0x0002", "锁妖塔崩毁·外景" },
	{ "0x0003", "飞仙术初展" },
	{ "0x0004", "林月如殒命" },
	{ "0x0005", "锁妖塔崩毁·内景" },
	{ "0x0006", "SOFTSTAR" },
	{ "0x0007", "祈雨·前段" },
	{ "0x0008", "祈雨·后段" },
	{ "0x0009", "最终之战" },
	{ "0x000a", "别苗疆" },
	{ "0x000b", "圣女渺" }
};

static const CHAR MusicID[][iMessagesChildLen][32] = {
	{ "0x0000", "停止播放" },
	{ "0x0001", "我方全灭" },
	{ "0x0002", "修行晋" },
	{ "0x0003", "得胜令" },
	{ "0x0004", "云谷鹤峰2" },
	{ "0x0005", "云谷鹤峰1" },
	{ "0x0006", "蝶殇_变奏" },
	{ "0x0007", "蝶殇" },
	{ "0x0008", "乡野风光" },
	{ "0x0009", "蝶思_变奏" },
	{ "0x000a", "觅仙踪" },
	{ "0x000b", "惊" },
	{ "0x000c", "小桥流水" },
	{ "0x000d", "来世再续未了缘" },
	{ "0x000e", "比武招亲" },
	{ "0x000f", "蝶思" },
	{ "0x0010", "太古情怨" },
	{ "0x0011", "魂牵梦萦" },
	{ "0x0012", "逆天而行" },
	{ "0x0013", "阴坛诡影" },
	{ "0x0014", "兵凶战危" },
	{ "0x0015", "救黎民" },
	{ "0x0016", "魂萦梦牵_变奏" },
	{ "0x0017", "蒙难" },
	{ "0x0018", "盟誓" },
	{ "0x0019", "遇袭" },
	{ "0x001a", "十面埋伏" },
	{ "0x001b", "蝶恋_变奏" },
	{ "0x001c", "红尘路缈" },
	{ "0x001d", "无" },
	{ "0x001e", "未收录曲目-隐龙窟" },
	{ "0x001f", "乐逍遥" },
	{ "0x0020", "宿命" },
	{ "0x0021", "身陷囹圄" },
	{ "0x0022", "危机" },
	{ "0x0023", "神木林" },
	{ "0x0024", "神木林变奏-夜色" },
	{ "0x0025", "风起云涌" },
	{ "0x0026", "势如破竹" },
	{ "0x0027", "心急如焚" },
	{ "0x0028", "战意昂" },
	{ "0x0029", "飞沙走石" },
	{ "0x002a", "侠客行" },
	{ "0x002b", "罗汉阵" },
	{ "0x002c", "腥风血雨" },
	{ "0x002d", "无所遁形" },
	{ "0x002e", "兵凶战危_变奏" },
	{ "0x002f", "御剑伏魔" },
	{ "0x0030", "御剑伏魔_变奏" },
	{ "0x0031", "余杭春日" },
	{ "0x0032", "繁华看尽" },
	{ "0x0033", "富甲一方" },
	{ "0x0034", "蝶舞春园" },
	{ "0x0035", "步履京城" },
	{ "0x0036", "大开眼界" },
	{ "0x0037", "白河寒秋" },
	{ "0x0038", "桃花幻梦" },
	{ "0x0039", "心忐忑" },
	{ "0x003a", "颓城" },
	{ "0x003b", "仙梦迴魂" },
	{ "0x003c", "历险" },
	{ "0x003d", "窥春" },
	{ "0x003e", "梦醒" },
	{ "0x003f", "终曲" },
	{ "0x0040", "醉仙驱魔" },
	{ "0x0041", "戏仙" },
	{ "0x0042", "春色无边" },
	{ "0x0043", "神佑" },
	{ "0x0044", "雨" },
	{ "0x0045", "看尽前尘" },
	{ "0x0046", "灵山" },
	{ "0x0047", "繁华看尽_变调" },
	{ "0x0048", "凌云壮志" },
	{ "0x0049", "春风恋牡丹" },
	{ "0x004a", "美景" },
	{ "0x004b", "情牵" },
	{ "0x004c", "今生情不悔" },
	{ "0x004d", "云谷鹤峰3" },
	{ "0x004e", "步步为营" },
	{ "0x004f", "灵怨" },
	{ "0x0050", "救佳人" },
	{ "0x0051", "险境" },
	{ "0x0052", "血海余生" },
	{ "0x0053", "鬼影幢幢" },
	{ "0x0054", "雨_变奏" },
	{ "0x0055", "梦醒_变奏" },
	{ "0x0056", "酒剑仙" },
	{ "0x0057", "孤雀无栖" }
};

static const CHAR MusicParamID[][iMessagesChildLen][16] = {
	{ "0x0000", "循环" },
	{ "0x0001", "只播一次" },
	{ "0x0003", "淡入" }
};

static const CHAR PaletteID[][iMessagesChildLen][32] = {
	{ "0x0000", "常时·日/夜" },
	{ "0x0001", "动画·云谷鹤峰" },
	{ "0x0002", "动画·长空万里展飞仙" },
	{ "0x0003", "动画·SOFTSTAR" },
	{ "0x0004", "最终之战·决死行" },
	{ "0x0005", "忆往昔·日/夜" },
	{ "0x0006", "动画·立命生民祈甘霖" },
	{ "0x0007", "无" },
	{ "0x0008", "动画·长别此生伤心处" }
};

static const CHAR PictureID[][iMessagesChildLen + 1][36] = {
	{ "0x0000", "状态背景", "状态背景" },
	{ "0x0001", "装备背景", "装备背景" },
	{ "0x0002", "仙灵岛", "书剑酒葫芦" },
	{ "0x0003", "苏州城郊","远山·上" },
	{ "0x0004", "水底密道","远山·下" },
	{ "0x0005", "蛤蟆山","无图像" },
	{ "0x0006", "鬼阴山", "鬼阴山·山脚竹林" },
	{ "0x0007", "毒仙林", "苏州城郊" },
	{ "0x0008", "十里坡", "水底密道" },
	{ "0x0009", "扬州山道", "蛤蟆山·前段" },
	{ "0x000a", "蜀山云海", "鬼阴山" },
	{ "0x000b", "木道人", "毒仙林" },
	{ "0x000c", "木秘宫2", "十里坡" },
	{ "0x000d", "神木林", "扬州山道" },
	{ "0x000e", "凤凰巢", "木道人" },
	{ "0x000f", "玉佛寺", "木秘宫2" },
	{ "0x0010", "鬼阴坛", "神木林" },
	{ "0x0011", "蛤蟆洞", "凤凰巢" },
	{ "0x0012", "阴森所在·僵尸王", "水魔兽" },
	{ "0x0013", "极阳地·赤鬼王-火麒麟", "苏州城郊·临城" },
	{ "0x0014", "白苗街巷", "蛤蟆山·后段" },
	{ "0x0015", "客栈", "阴森所在·僵尸王" },
	{ "0x0016", "神木林底", "极阳地·赤鬼王" },
	{ "0x0017", "扬州屋顶-未调用0", "白苗街巷" },
	{ "0x0018", "隐龙窟", "客栈" },
	{ "0x0019", "满地菌-未调用1", "神木林底" },
	{ "0x001a", "比武招亲", "扬州屋顶-未调用0" },
	{ "0x001b", "巨蜘蛛网", "隐龙窟" },
	{ "0x001c", "尚书府", "满地菌-未调用1" },
	{ "0x001d", "乱葬岗", "尚书府" },
	{ "0x001e", "扬州城墙", "乱葬岗" },
	{ "0x001f", "七星盘龙柱", "扬州城墙" },
	{ "0x0020", "血池", "七星盘龙柱" },
	{ "0x0021", "红板-未调用2", "蜀山云海" },
	{ "0x0022", "将军冢", "试炼窟" },
	{ "0x0023", "锁妖塔","火麒麟洞" },
	{ "0x0024", "深渊裂口", "蛤蟆洞·前段·柳媚娘" },
	{ "0x0025", "木秘宫", "蛤蟆洞·后段" },
	{ "0x0026", "远山·上", "红板-未调用2·蛇谷" },
	{ "0x0027", "远山·下", "将军冢" },
	{ "0x0028", "结局字幕·企划程式", "锁妖塔" },
	{ "0x0029", "结局画面·李逍遥", "木秘宫" },
	{ "0x002a", "结局字幕·插画", "巨蜘蛛网" },
	{ "0x002b", "结局画面·赵灵儿", "乱葬岗·后段" },
	{ "0x002c", "结局字幕·美术", "黑水镇" },
	{ "0x002d", "结局画面·林月如", "蛤蟆洞2-未调用3" },
	{ "0x002e", "结局字幕·音乐音效", "鬼阴守洞" },
	{ "0x002f", "结局画面·阿奴", "桃花林" },
	{ "0x0030", "结局字幕·监制", "南邵王宫" },
	{ "0x0031", "结局字幕·全剧终", "南邵地牢" },
	{ "0x0032", "乱葬岗后", "水底密道" },
	{ "0x0033", "乱葬岗后1-未调用3", "南邵王座" },
	{ "0x0034", "鬼阴守洞", "比武招亲" },
	{ "0x0035", "蛤蟆洞2", "血池" },
	{ "0x0036", "桃花林", "无底深渊" },
	{ "0x0037", "南邵王宫", "鬼阴山洞内" },
	{ "0x0038", "南邵地牢", "玉佛寺" },
	{ "0x0039", "南邵王座", "鬼阴坛" },
	{ "0x003a", "试炼窟", "结局字幕·企划程式" },
	{ "0x003b", "鬼阴山内", "结局画面·李逍遥" },
	{ "0x003c", "书剑酒葫芦", "结局字幕·插画" },
	{ "0x003d", "最终动画·云一", "结局画面·赵灵儿" },
	{ "0x003e", "最终动画·云二", "结局字幕·美术" },
	{ "0x003f", "拼图", "结局画面·林月如" },
	{ "0x0040", "水魔兽", "结局字幕·音乐音效" },
	{ "0x0041", "最终动画·月如执伞", "结局画面·阿奴" },
	{ "0x0042", "最终动画·雪中逍遥·上", "结局字幕·监制" },
	{ "0x0043", "最终动画·雪中逍遥·下", "结局字幕·全剧终" },
	{ "0x0044", "最终动画·拜月魔兽", "最终动画·云一" },
	{ "0x0045", "最终动画·洪水", "最终动画·云二" },
	{ "0x0046", "黑屏", "最终动画·月如执伞" },
	{ "0x0047", "最终动画·阿奴奏笛", "最终动画·雪中逍遥·上" },
	{ "0x0048", "不存在", "最终动画·雪中逍遥·下" },
	{ "0x0049", "不存在", "最终动画·拜月魔兽" },
	{ "0x004a", "不存在", "最终动画·洪水" },
	{ "0x004b", "不存在", "黑屏" },
	{ "0x004c", "不存在", "最终动画·阿奴奏笛" },
	{ "0xffff", "黑底屏", "黑底屏" }
};

static const CHAR RoleID[][iMessagesChildLen][16] = {
	{ "0x0000", "李逍遥" },
	{ "0x0001", "赵灵儿" },
	{ "0x0002", "林月如" },
	{ "0x0003", "巫后" },
	{ "0x0004", "阿奴" },
	{ "0x0005", "盖罗娇" }
};

static const CHAR SceneID[][iMessagesChildLen][86] = {
	{ "0x0000", "无场景" },
	{ "0x0001", "余杭.客栈各分立房间.原始" },
	{ "0x0002", "余杭.客栈各分立房间.灵儿被劫" },
	{ "0x0003", "余杭.客栈大厅" },
	{ "0x0004", "余杭.盛渔村" },
	{ "0x0005", "余杭.集市" },
	{ "0x0006", "余杭.十里坡" },
	{ "0x0007", "余杭.山神庙外" },
	{ "0x0008", "余杭.老王家.老丁家" },
	{ "0x0009", "余杭.废屋" },
	{ "0x000a", "余杭.洪大夫诊所" },
	{ "0x000b", "余杭.山神庙里" },
	{ "0x000c", "余杭.打铁铺" },
	{ "0x000d", "余杭.林师傅木工铺" },
	{ "0x000e", "仙灵岛.花树.灵池.原始" },
	{ "0x000f", "仙灵岛.岸边" },
	{ "0x0010", "仙灵岛.草妖峡谷" },
	{ "0x0011", "仙灵岛.莲池.断" },
	{ "0x0012", "仙灵岛.莲池.连" },
	{ "0x0013", "仙灵岛.洞天" },
	{ "0x0014", "仙灵岛.水月宫.未赠药" },
	{ "0x0015", "苏州.内.初至" },
	{ "0x0016", "苏州.外" },
	{ "0x0017", "苏州.内.次日" },
	{ "0x0018", "苏州.城东民居" },
	{ "0x0019", "苏州.客栈.大厅" },
	{ "0x001a", "苏州.客栈.各单间" },
	{ "0x001b", "苏州.客栈.大通铺" },
	{ "0x001c", "苏州.客栈.赌厅" },
	{ "0x001d", "苏州.当铺" },
	{ "0x001e", "苏州.药铺" },
	{ "0x001f", "苏州.兵器铺" },
	{ "0x0020", "苏州.林家堡.演武厅.比武招亲" },
	{ "0x0021", "苏州.林家堡.演武厅.演武结束" },
	{ "0x0022", "苏州.林家堡.客厅" },
	{ "0x0023", "苏州.林家堡.后院" },
	{ "0x0024", "苏州.林家堡.西厢房.原始" },
	{ "0x0025", "苏州.林家堡.西厢房.墙破" },
	{ "0x0026", "苏州.林家堡.东厢房" },
	{ "0x0027", "隐龙窟.山道" },
	{ "0x0028", "隐龙窟.迷宫.终.无蛇妖男" },
	{ "0x0029", "隐龙窟.迷宫.终.蛇妖男" },
	{ "0x002a", "隐龙窟.近迹" },
	{ "0x002b", "隐龙窟.柴翁居.1" },
	{ "0x002c", "隐龙窟.柴翁居.2" },
	{ "0x002d", "隐龙窟.迷宫.1" },
	{ "0x002e", "隐龙窟.迷宫.2" },
	{ "0x002f", "隐龙窟.内洞" },
	{ "0x0030", "山路.白河村.前" },
	{ "0x0031", "白河村" },
	{ "0x0032", "白河村.米行" },
	{ "0x0033", "白河村.各分立屋宇" },
	{ "0x0034", "白河村.韩医仙屋外" },
	{ "0x0035", "白河村.韩医仙诊厅" },
	{ "0x0036", "山路.白河村后" },
	{ "0x0037", "鬼阴山.山路" },
	{ "0x0038", "玉佛寺.寺外.庙宇未消失" },
	{ "0x0039", "玉佛寺.寺外.庙宇消失" },
	{ "0x003a", "玉佛寺.寺内" },
	{ "0x003b", "将军冢.墓底.血池" },
	{ "0x003c", "将军冢.上层" },
	{ "0x003d", "黑水镇" },
	{ "0x003e", "黑水镇.各分立屋宇" },
	{ "0x003f", "乱葬岗.荒野" },
	{ "0x0040", "乱葬岗.墓地" },
	{ "0x0041", "将军冢.下层.1" },
	{ "0x0042", "将军冢.下层.2" },
	{ "0x0043", "鬼阴山.鬼阴坛.密谋" },
	{ "0x0044", "鬼阴山.山路" },
	{ "0x0045", "鬼阴山.绝顶" },
	{ "0x0046", "鬼阴山.迷宫" },
	{ "0x0047", "鬼阴山.迷宫" },
	{ "0x0048", "鬼阴山.迷宫" },
	{ "0x0049", "鬼阴山.迷宫" },
	{ "0x004a", "鬼阴山.迷宫" },
	{ "0x004b", "鬼阴山.迷宫" },
	{ "0x004c", "鬼阴山.鬼阴坛石室" },
	{ "0x004d", "鬼阴山.鬼阴坛.得救" },
	{ "0x004e", "鬼阴山.鬼阴坛后门" },
	{ "0x004f", "扬州.废城" },
	{ "0x0050", "山道.鬼阴山后" },
	{ "0x0051", "扬州.府衙.痛揍" },
	{ "0x0052", "扬州.1" },
	{ "0x0053", "山道.扬州前" },
	{ "0x0054", "扬州.2" },
	{ "0x0055", "扬州.3" },
	{ "0x0056", "扬州.4" },
	{ "0x0057", "扬州.5" },
	{ "0x0058", "飞贼之家.无.地牢入口.可以进入" },
	{ "0x0059", "飞贼之家.隐.地牢入口.无法进入" },
	{ "0x005a", "飞贼之家.显" },
	{ "0x005b", "扬州.牢房" },
	{ "0x005c", "井底密道.飞贼密室" },
	{ "0x005d", "扬州.客栈" },
	{ "0x005e", "扬州.客栈.杂物间" },
	{ "0x005f", "扬州.客栈.灶间" },
	{ "0x0060", "扬州.各独立商户及井后空屋" },
	{ "0x0061", "扬州.客栈.各独立间" },
	{ "0x0062", "扬州.城墙.各岗哨" },
	{ "0x0063", "扬州.民居" },
	{ "0x0064", "长安" },
	{ "0x0065", "蛤蟆谷.后段" },
	{ "0x0066", "蛤蟆谷.前段" },
	{ "0x0067", "蛤蟆洞.前段" },
	{ "0x0068", "蛤蟆洞.后段" },
	{ "0x0069", "山路.蛤蟆谷前" },
	{ "0x006a", "山路.白苗驿站.驿站外" },
	{ "0x006b", "长安城外.田园摸牛" },
	{ "0x006c", "长安.尚书府.刘晋元居所外" },
	{ "0x006d", "长安.尚书府.刘晋元居所外" },
	{ "0x006e", "长安城外.白苗驿站.驿站内" },
	{ "0x006f", "长安.水仙尊王庙外" },
	{ "0x0070", "长安.水仙尊王庙外.无船" },
	{ "0x0071", "田园.蛤蟆谷前" },
	{ "0x0072", "长安.尚书府内" },
	{ "0x0073", "长安.尚书府内" },
	{ "0x0074", "长安.尚书府.幽径" },
	{ "0x0075", "长安.尚书府.刘晋元居所外.毒仙林关闭" },
	{ "0x0076", "长安.尚书府.大厅" },
	{ "0x0077", "长安.尚书府.大厅.楼上" },
	{ "0x0078", "长安.尚书府.膳厅.原始" },
	{ "0x0079", "长安.尚书府.膳厅.用餐后" },
	{ "0x007a", "长安.尚书府.刘晋元居所.原始" },
	{ "0x007b", "长安.尚书府.刘晋元居所.第一次下楼.讨论" },
	{ "0x007c", "长安.尚书府.刘晋元居所.刘晋元房间.原始.刘晋元趴倒" },
	{ "0x007d", "长安.尚书府.刘晋元居所.刘晋元房间.刘晋元立" },
	{ "0x007e", "长安.尚书府.刘晋元居所.刘晋元房间.笨天师画符" },
	{ "0x007f", "长安.酒楼.一层" },
	{ "0x0080", "长安.荒酒楼.无人" },
	{ "0x0081", "长安.百花浴" },
	{ "0x0082", "长安.妓院.一楼" },
	{ "0x0083", "长安.妓院.二楼" },
	{ "0x0084", "长安.妓院.各房间" },
	{ "0x0085", "长安.妓院.各房间" },
	{ "0x0086", "长安.妓院.各房间.莺莺夫人" },
	{ "0x0087", "长安.兵器铺" },
	{ "0x0088", "长安.民居" },
	{ "0x0089", "长安.民居.商人家" },
	{ "0x008a", "毒仙林.大蜘蛛居所.战前" },
	{ "0x008b", "毒仙林.迷宫" },
	{ "0x008c", "毒仙林.大蜘蛛居所.战后" },
	{ "0x008d", "忆往昔.毒仙林晋元救蝶" },
	{ "0x008e", "忆往昔.尚书府蝶仙化形" },
	{ "0x008f", "忆往昔.晋元房双亲订婚" },
	{ "0x0090", "锁妖塔.七星盘龙柱" },
	{ "0x0091", "锁妖塔.底层.灵儿被缚" },
	{ "0x0092", "锁妖塔.八层" },
	{ "0x0093", "锁妖塔.五层.姜清" },
	{ "0x0094", "锁妖塔.三层.天鬼皇" },
	{ "0x0095", "锁妖塔.五层.崩溃" },
	{ "0x0096", "蜀山云海.独立酒剑仙" },
	{ "0x0097", "田园.长安城外" },
	{ "0x0098", "锁妖塔.底层.未被缚" },
	{ "0x0099", "锁妖塔.底层.妖议" },
	{ "0x009a", "锁妖塔.三层.书中仙" },
	{ "0x009b", "蜀山.前山" },
	{ "0x009c", "锁妖塔.二层.化妖池" },
	{ "0x009d", "蜀山仙剑派正殿.外" },
	{ "0x009e", "蜀山仙剑派后山" },
	{ "0x009f", "蜀山仙剑派正殿.内" },
	{ "0x00a0", "仙剑派弟子房间" },
	{ "0x00a1", "蜀山云海.前段" },
	{ "0x00a2", "蜀山云海.后段" },
	{ "0x00a3", "锁妖塔外" },
	{ "0x00a4", "锁妖塔全景" },
	{ "0x00a5", "锁妖塔.七层" },
	{ "0x00a6", "锁妖塔.六层" },
	{ "0x00a7", "锁妖塔.四层" },
	{ "0x00a8", "锁妖塔.底层.外" },
	{ "0x00a9", "忆往昔.灵岛仙宫亲为辩" },
	{ "0x00aa", "忆往昔.灵池未料此般逢" },
	{ "0x00ab", "忆往昔.拼尽残生为还魂" },
	{ "0x00ac", "恍惚.林月如" },
	{ "0x00ad", "圣姑家.灵儿生产" },
	{ "0x00ae", "圣姑家.李逍遥醒来" },
	{ "0x00af", "桃源村" },
	{ "0x00b0", "圣姑室外" },
	{ "0x00b1", "圣姑室外.剑圣黯离" },
	{ "0x00b2", "桃花源.大雾" },
	{ "0x00b3", "灵山" },
	{ "0x00b4", "桃花源.门户" },
	{ "0x00b5", "桃花源.决战木道人" },
	{ "0x00b6", "桃源村.化林" },
	{ "0x00b7", "桃源村.褒奖" },
	{ "0x00b8", "树洞.迷宫" },
	{ "0x00b9", "神木林.凤凰巢" },
	{ "0x00ba", "神木林.底" },
	{ "0x00bb", "树洞.开" },
	{ "0x00bc", "废神木林" },
	{ "0x00bd", "桃花源.迷宫.前" },
	{ "0x00be", "桃花源.迷宫.后" },
	{ "0x00bf", "大理.各白苗住房" },
	{ "0x00c0", "神木林.迷宫" },
	{ "0x00c1", "忆往昔.欢喜冤家擂前约" },
	{ "0x00c2", "忆往昔.心事暗怀二人心" },
	{ "0x00c3", "忆往昔.忧逍遥月如离堡" },
	{ "0x00c4", "忆往昔.逞侠肝怒斥逃奴" },
	{ "0x00c5", "忆往昔.扬州夜月如幽叹" },
	{ "0x00c6", "忆往昔.尚书府二人谐心" },
	{ "0x00c7", "忆往昔.言犹在耳成永谶" },
	{ "0x00c8", "火麒麟洞.终.火麒麟兽" },
	{ "0x00c9", "梦之床" },
	{ "0x00ca", "大理.城郊.正常" },
	{ "0x00cb", "大理.女娲神殿.正常" },
	{ "0x00cc", "大理.祭坛.正常" },
	{ "0x00cd", "大理.族议厅.正常" },
	{ "0x00ce", "大理.废汉人聚居地" },
	{ "0x00cf", "大理.商业区" },
	{ "0x00d0", "大理.汉人聚居地.正常" },
	{ "0x00d1", "大理.汉人聚居地.商业区" },
	{ "0x00d2", "大理.族议厅.楼下" },
	{ "0x00d3", "大理.女娲神殿.外.正常" },
	{ "0x00d4", "火麒麟洞" },
	{ "0x00d5", "试炼窟.女娲遗迹" },
	{ "0x00d6", "土路.试炼窟外.1" },
	{ "0x00d7", "土路.试炼窟外.2.遭遇盖罗娇" },
	{ "0x00d8", "试炼窟.1" },
	{ "0x00d9", "试炼窟.2" },
	{ "0x00da", "试炼窟.3" },
	{ "0x00db", "试炼窟.4" },
	{ "0x00dc", "试炼窟.5.二层门" },
	{ "0x00dd", "试炼窟.废二层" },
	{ "0x00de", "试炼窟.二层.未知" },
	{ "0x00df", "试炼窟.二层.未知" },
	{ "0x00e0", "试炼窟.未知" },
	{ "0x00e1", "试炼窟.三层.未知" },
	{ "0x00e2", "试炼窟.三层.所有伏" },
	{ "0x00e3", "路途.回魂仙梦" },
	{ "0x00e4", "回魂仙梦.南绍王宫.地牢.关" },
	{ "0x00e5", "回魂仙梦.南绍王宫.外" },
	{ "0x00e6", "回魂仙梦.南绍王宫.秘道" },
	{ "0x00e7", "回魂仙梦.水底秘道.后段" },
	{ "0x00e8", "路途一.回魂仙梦" },
	{ "0x00e9", "回魂仙梦.水底秘道.前段" },
	{ "0x00ea", "回魂仙梦.南绍王宫.地牢.开" },
	{ "0x00eb", "回魂仙梦.南绍" },
	{ "0x00ec", "回魂仙梦.南绍王宫" },
	{ "0x00ed", "回魂仙梦.南绍王宫.内殿" },
	{ "0x00ee", "回魂仙梦.南绍王宫.秘道.外" },
	{ "0x00ef", "南绍王宫.无用宫室" },
	{ "0x00f0", "南绍王宫.无用宫室一" },
	{ "0x00f1", "南绍王宫.秘道.内.1.空" },
	{ "0x00f2", "南绍王宫.秘道.内.2.空" },
	{ "0x00f3", "南绍王宫.秘道.内.3.空" },
	{ "0x00f4", "南绍王宫.秘道.内.4.空" },
	{ "0x00f5", "回魂仙梦.南绍王宫.秘道.地牢.囚怪" },
	{ "0x00f6", "南绍王宫.秘道.内.石室.天蛇杖" },
	{ "0x00f7", "回魂仙梦.余杭.山神庙.外" },
	{ "0x00f8", "回魂仙梦.余杭.十年前" },
	{ "0x00f9", "回魂仙梦.余杭.山神庙.内.姥姥伤" },
	{ "0x00fa", "回魂仙梦.余杭.十里坡" },
	{ "0x00fb", "回魂仙梦.余杭.客栈.大厅" },
	{ "0x00fc", "回魂仙梦.余杭.客栈.房间" },
	{ "0x00fd", "回魂仙梦.余杭" },
	{ "0x00fe", "回魂仙梦.余杭.集市" },
	{ "0x00ff", "回魂仙梦.余杭.集市.各无人分立屋宇.废屋" },
	{ "0x0100", "回魂仙梦.余杭.集市.铁匠铺" },
	{ "0x0101", "回魂仙梦.余杭.集市.林师傅木匠铺" },
	{ "0x0102", "大理.祭坛.已摆满.动画前" },
	{ "0x0103", "大理.城郊.战" },
	{ "0x0104", "路.试炼窟外.战" },
	{ "0x0105", "大理.城郊.战.天降甘霖.新的生机" },
	{ "0x0106", "大理.祭坛.载歌载舞" },
	{ "0x0107", "大理.女娲神殿.外.防" },
	{ "0x0108", "大理.女娲神殿.灵儿拜母" },
	{ "0x0109", "大理.女娲神殿.防" },
	{ "0x010a", "火麒麟洞.终.无" },
	{ "0x010b", "大理.族议厅.战" },
	{ "0x010c", "大理.各分立屋宇.空.逃难.未知" },
	{ "0x010d", "大理.汉人聚居地.屠杀" },
	{ "0x010e", "大理.汉人聚居地.商业区.空" },
	{ "0x010f", "大理.民居.未知.空" },
	{ "0x0110", "大理.祭坛.空.疑为开口" },
	{ "0x0111", "火麒麟洞.1.空" },
	{ "0x0112", "废大理.空.不整" },
	{ "0x0113", "大理.雨后" },
	{ "0x0114", "大理.女娲神殿.外.雨中" },
	{ "0x0115", "南绍王宫.秘道.外" },
	{ "0x0116", "南绍王宫.内殿.假巫王" },
	{ "0x0117", "南绍王宫.秘道.内.怪" },
	{ "0x0118", "南绍王宫.外.空" },
	{ "0x0119", "南绍王宫.空" },
	{ "0x011a", "南绍王宫.无用宫室" },
	{ "0x011b", "南绍王宫.无用宫室一" },
	{ "0x011c", "南绍王宫.地牢.门开" },
	{ "0x011d", "南绍王宫.秘道.1.怪" },
	{ "0x011e", "南绍王宫.秘道.2.怪" },
	{ "0x011f", "南绍王宫.秘道.3.怪" },
	{ "0x0120", "南绍王宫.秘道.4.怪" },
	{ "0x0121", "南绍王宫.秘道.地牢.怪" },
	{ "0x0122", "南绍王宫.秘道.5.宝" },
	{ "0x0123", "无底深渊.1" },
	{ "0x0124", "无底深渊.2" },
	{ "0x0125", "无底深渊.起始" },
	{ "0xffff", "无" }
};

static const CHAR SpriteID[][iMessagesChildLen][64] = {
	{ "0x0000", "无图像" },
	{ "0x0001", "鲤鱼" },
	{ "0x0002", "李逍遥" },
	{ "0x0003", "赵灵儿" },
	{ "0x0004", "丁秀兰" },
	{ "0x0005", "阿奴" },
	{ "0x0006", "唐钰" },
	{ "0x0007", "林月如" },
	{ "0x0008", "蜡烛" },
	{ "0x0009", "油灯" },
	{ "0x000A", "剑宝箱" },
	{ "0x000B", "鬼灯笼" },
	{ "0x000C", "天鬼皇" },
	{ "0x000D", "张四哥" },
	{ "0x000E", "水生叔" },
	{ "0x000F", "青年侠士" },
	{ "0x0010", "酒剑仙" },
	{ "0x0011", "病重刘晋元" },
	{ "0x0012", "姥姥" },
	{ "0x0013", "正常金蟾鬼母" },
	{ "0x0014", "丁香兰" },
	{ "0x0015", "李大娘" },
	{ "0x0016", "阿桃" },
	{ "0x0017", "人身彩依" },
	{ "0x0018", "南蛮王" },
	{ "0x0019", "姜婉儿" },
	{ "0x001A", "盖罗娇" },
	{ "0x001B", "毒娘子" },
	{ "0x001C", "黑苗头领" },
	{ "0x001D", "黑苗喽罗" },
	{ "0x001E", "持棍苗兵" },
	{ "0x001F", "商贾" },
	{ "0x0020", "王小虎" },
	{ "0x0021", "居民" },
	{ "0x0022", "定身商贾" },
	{ "0x0023", "丁伯" },
	{ "0x0024", "渔叟" },
	{ "0x0025", "鱼漂" },
	{ "0x0026", "圣灵儿" },
	{ "0x0027", "樵夫" },
	{ "0x0028", "方老板" },
	{ "0x0029", "斗笠水生叔" },
	{ "0x002A", "喂鸡妇" },
	{ "0x002B", "撒米" },
	{ "0x002C", "母鸡" },
	{ "0x002D", "公鸡" },
	{ "0x002E", "白母鸡" },
	{ "0x002F", "小鸡" },
	{ "0x0030", "旺财嫂" },
	{ "0x0031", "来福婶" },
	{ "0x0032", "跳绳小孩们" },
	{ "0x0033", "渔嫂" },
	{ "0x0034", "小鱼" },
	{ "0x0035", "右门板" },
	{ "0x0036", "左门板" },
	{ "0x0037", "暗道顶板" },
	{ "0x0038", "醉倒酒剑仙" },
	{ "0x0039", "酒菜" },
	{ "0x003A", "病李大婶" },
	{ "0x003B", "僵尸" },
	{ "0x003C", "树妖" },
	{ "0x003D", "鸟" },
	{ "0x003E", "门扇" },
	{ "0x003F", "门扇" },
	{ "0x0040", "门扇开" },
	{ "0x0041", "门扇开" },
	{ "0x0042", "阿修罗像" },
	{ "0x0043", "观音像" },
	{ "0x0044", "药草" },
	{ "0x0045", "药草1" },
	{ "0x0046", "灵山仙芝" },
	{ "0x0047", "仙剑奇侠传印鉴" },
	{ "0x0048", "酒徒" },
	{ "0x0049", "仙鹤" },
	{ "0x004A", "宝剑" },
	{ "0x004B", "病老人" },
	{ "0x004C", "跳绳小孩" },
	{ "0x004D", "跳绳小孩1" },
	{ "0x004E", "跳绳小孩2" },
	{ "0x004F", "骑木马小孩" },
	{ "0x0050", "刘尚书" },
	{ "0x0051", "尚书夫人" },
	{ "0x0052", "书生" },
	{ "0x0053", "挎包书生" },
	{ "0x0054", "苇漂" },
	{ "0x0055", "爆炸花" },
	{ "0x0056", "坟茔" },
	{ "0x0057", "水月宫门牌" },
	{ "0x0058", "水月洞天碑" },
	{ "0x0059", "洪大夫" },
	{ "0x005A", "守店洪大夫" },
	{ "0x005B", "商人" },
	{ "0x005C", "原地商人" },
	{ "0x005D", "挎包商人" },
	{ "0x005E", "原地挎包商人" },
	{ "0x005F", "无赖" },
	{ "0x0060", "铁匠" },
	{ "0x0061", "捕快" },
	{ "0x0062", "原地捕快" },
	{ "0x0063", "江湖痞子" },
	{ "0x0064", "原地江湖痞子" },
	{ "0x0065", "恶少" },
	{ "0x0066", "原地恶少" },
	{ "0x0067", "流氓" },
	{ "0x0068", "原地流氓" },
	{ "0x0069", "古董商" },
	{ "0x006A", "原地古董商" },
	{ "0x006B", "丐帮" },
	{ "0x006C", "原地木道人" },
	{ "0x006D", "剑老头魂" },
	{ "0x006E", "童子" },
	{ "0x006F", "原地童子" },
	{ "0x0070", "胖伙计" },
	{ "0x0071", "原地胖伙计" },
	{ "0x0072", "看书书生" },
	{ "0x0073", "原地看书书生" },
	{ "0x0074", "皮毛商人" },
	{ "0x0075", "原地皮毛商人" },
	{ "0x0076", "钓者" },
	{ "0x0077", "原地钓者" },
	{ "0x0078", "桃村长" },
	{ "0x0079", "原地桃村长" },
	{ "0x007A", "卜者" },
	{ "0x007B", "原地卜者" },
	{ "0x007C", "居者" },
	{ "0x007D", "原地居者" },
	{ "0x007E", "小二" },
	{ "0x007F", "原地小二" },
	{ "0x0080", "二百五" },
	{ "0x0081", "原地二百五" },
	{ "0x0082", "阿七" },
	{ "0x0083", "原地阿七" },
	{ "0x0084", "和尚" },
	{ "0x0085", "原地和尚" },
	{ "0x0086", "原地府兵" },
	{ "0x0087", "原地老和尚" },
	{ "0x0088", "原地蠢道士" },
	{ "0x0089", "原地衙役" },
	{ "0x008A", "女居民" },
	{ "0x008B", "女居民1" },
	{ "0x008C", "原地女居民1" },
	{ "0x008D", "女居民2" },
	{ "0x008E", "原地女居民2" },
	{ "0x008F", "女居民3" },
	{ "0x0090", "原地女居民3" },
	{ "0x0091", "坐柳媚娘" },
	{ "0x0092", "持盒侍女" },
	{ "0x0093", "奉盏侍女" },
	{ "0x0094", "侍女" },
	{ "0x0095", "儿童" },
	{ "0x0096", "儿童1" },
	{ "0x0097", "儿童2" },
	{ "0x0098", "儿童3" },
	{ "0x0099", "儿童4" },
	{ "0x009A", "儿童5" },
	{ "0x009B", "儿童6" },
	{ "0x009C", "儿童7" },
	{ "0x009D", "儿童8" },
	{ "0x009E", "儿童9" },
	{ "0x009F", "儿童a" },
	{ "0x00A0", "蝴蝶" },
	{ "0x00A1", "蝴蝶1" },
	{ "0x00A2", "蝴蝶2" },
	{ "0x00A3", "原地林木匠" },
	{ "0x00A4", "原地葫芦" },
	{ "0x00A5", "蝴蝶3" },
	{ "0x00A6", "蝴蝶4" },
	{ "0x00A7", "原地丐帮" },
	{ "0x00A8", "前半身姑娘" },
	{ "0x00A9", "右半身姑娘" },
	{ "0x00AA", "后半身姑娘" },
	{ "0x00AB", "左半身姑娘" },
	{ "0x00AC", "前半身公子" },
	{ "0x00AD", "右半身公子" },
	{ "0x00AE", "后半身公子" },
	{ "0x00AF", "左半身公子" },
	{ "0x00B0", "半身无赖1" },
	{ "0x00B1", "半身无赖2" },
	{ "0x00B2", "半身无赖3" },
	{ "0x00B3", "半身无赖4" },
	{ "0x00B4", "半身商人1" },
	{ "0x00B5", "半身商人1" },
	{ "0x00B6", "半身商人2" },
	{ "0x00B7", "半身商人3" },
	{ "0x00B8", "半身女子二1" },
	{ "0x00B9", "半身女子二2" },
	{ "0x00BA", "半身女子二3" },
	{ "0x00BB", "半身女子二4" },
	{ "0x00BC", "坐女子" },
	{ "0x00BD", "躺男" },
	{ "0x00BE", "躺儿童" },
	{ "0x00BF", "躺老人" },
	{ "0x00C0", "躺青年" },
	{ "0x00C1", "躺李逍遥" },
	{ "0x00C2", "挥鞭林月如" },
	{ "0x00C3", "被绑奴仆" },
	{ "0x00C4", "行舟" },
	{ "0x00C5", "撑篙张四哥" },
	{ "0x00C6", "白苗使者" },
	{ "0x00C7", "白苗店员" },
	{ "0x00C8", "女" },
	{ "0x00C9", "女1" },
	{ "0x00CA", "黑苗女" },
	{ "0x00CB", "黑苗女1" },
	{ "0x00CC", "黑苗男" },
	{ "0x00CD", "黑苗男1" },
	{ "0x00CE", "白苗男" },
	{ "0x00CF", "黑苗头领" },
	{ "0x00D0", "端盘子李逍遥" },
	{ "0x00D1", "蜜汁火腿" },
	{ "0x00D2", "布袋灵儿" },
	{ "0x00D3", "布袋" },
	{ "0x00D4", "弥留姥姥" },
	{ "0x00D5", "姥姥杖" },
	{ "0x00D6", "胁李大婶黑苗头领" },
	{ "0x00D7", "被胁李大婶" },
	{ "0x00D8", "黑苗儿童" },
	{ "0x00D9", "白苗儿童" },
	{ "0x00DA", "苗区汉民儿童" },
	{ "0x00DB", "黑苗儿童1" },
	{ "0x00DC", "小石头" },
	{ "0x00DD", "渔民逍遥" },
	{ "0x00DE", "跪灵儿" },
	{ "0x00DF", "原地水月侍女" },
	{ "0x00E0", "原地执苕水月侍女" },
	{ "0x00E1", "原地背面水月侍女" },
	{ "0x00E2", "原地背面血泊水月侍女" },
	{ "0x00E3", "原地正面血泊水月侍女" },
	{ "0x00E4", "李逍遥为林月如刺死" },
	{ "0x00E5", "林月如刺李逍遥" },
	{ "0x00E6", "越女剑" },
	{ "0x00E7", "原地航船" },
	{ "0x00E8", "空空如也" },
	{ "0x00E9", "石板.发亮石板" },
	{ "0x00EA", "群殴刘晋元" },
	{ "0x00EB", "伏案灵儿" },
	{ "0x00EC", "伏案逍遥" },
	{ "0x00ED", "伏案刘晋元" },
	{ "0x00EE", "睡灵儿" },
	{ "0x00EF", "半睡灵儿" },
	{ "0x00F0", "守擂林月如" },
	{ "0x00F1", "攻擂双锤手" },
	{ "0x00F2", "压倒逍遥" },
	{ "0x00F3", "刘晋元" },
	{ "0x00F4", "拭泪灵儿" },
	{ "0x00F5", "盛装月如" },
	{ "0x00F6", "化蛇灵儿" },
	{ "0x00F7", "原地林天南" },
	{ "0x00F8", "持灯林家侍女" },
	{ "0x00F9", "原地刘家侍女" },
	{ "0x00FA", "白河民夫" },
	{ "0x00FB", "荷戈蛇妖" },
	{ "0x00FC", "坐蛇妖女" },
	{ "0x00FD", "棺内骷髅将军" },
	{ "0x00FE", "赤鬼王浮现" },
	{ "0x00FF", "石门" },
	{ "0x0100", "白河鲤" },
	{ "0x0101", "白河小鲤" },
	{ "0x0102", "鬼阴山碑" },
	{ "0x0103", "垂钓李逍遥" },
	{ "0x0104", "滴水" },
	{ "0x0105", "干裂地" },
	{ "0x0106", "左壁泉" },
	{ "0x0107", "前壁泉" },
	{ "0x0108", "将军冢入口" },
	{ "0x0109", "韩医仙药童" },
	{ "0x010A", "鹿" },
	{ "0x010B", "刘家侍女" },
	{ "0x010C", "捕兽夹" },
	{ "0x010D", "将军冢活门" },
	{ "0x010E", "将军冢活门1" },
	{ "0x010F", "将军冢活门机关" },
	{ "0x0110", "血池泡" },
	{ "0x0111", "三人皆昏" },
	{ "0x0112", "右门x" },
	{ "0x0113", "左门x" },
	{ "0x0114", "半身伏案居民1" },
	{ "0x0115", "半身伏案居民2" },
	{ "0x0116", "半身伏案居民3" },
	{ "0x0117", "半身伏案居民4" },
	{ "0x0118", "半身伏案老丈1" },
	{ "0x0119", "半身伏案老丈2" },
	{ "0x011A", "半身伏案老丈3" },
	{ "0x011B", "半身伏案老丈4" },
	{ "0x011C", "半身伏案商贾1" },
	{ "0x011D", "半身伏案商贾2" },
	{ "0x011E", "半身伏案商贾3" },
	{ "0x011F", "半身伏案商贾4" },
	{ "0x0120", "半身伏案无赖1" },
	{ "0x0121", "半身伏案无赖2" },
	{ "0x0122", "半身伏案无赖3" },
	{ "0x0123", "半身伏案无赖4" },
	{ "0x0124", "两面半身伏案商贾1" },
	{ "0x0125", "两面半身伏案商贾2" },
	{ "0x0126", "半身伏案商贾1" },
	{ "0x0127", "半身伏案商贾2" },
	{ "0x0128", "半身伏案商贾3" },
	{ "0x0129", "血池机关" },
	{ "0x012A", "血池机关" },
	{ "0x012B", "骷髅头" },
	{ "0x012C", "鬼阴坛大旗" },
	{ "0x012D", "鹅" },
	{ "0x012E", "开门" },
	{ "0x012F", "开门" },
	{ "0x0130", "开右门" },
	{ "0x0131", "开左门" },
	{ "0x0132", "侍女" },
	{ "0x0133", "侍女" },
	{ "0x0134", "夜壶.黄褐色酒瓶" },
	{ "0x0135", "左伏案少女" },
	{ "0x0136", "左伏案商人" },
	{ "0x0137", "左伏案少女1" },
	{ "0x0138", "左伏案商人1" },
	{ "0x0139", "姑娘" },
	{ "0x013A", "八婆" },
	{ "0x013B", "原地八婆" },
	{ "0x013C", "肥公" },
	{ "0x013D", "原地肥公" },
	{ "0x013E", "肥婆" },
	{ "0x013F", "原地肥婆" },
	{ "0x0140", "闺秀" },
	{ "0x0141", "原地闺秀" },
	{ "0x0142", "少妇" },
	{ "0x0143", "原地少妇" },
	{ "0x0144", "闺秀1" },
	{ "0x0145", "原地闺秀1" },
	{ "0x0146", "少妇1" },
	{ "0x0147", "原地少妇1" },
	{ "0x0148", "少女2" },
	{ "0x0149", "原地少女2" },
	{ "0x014A", "贵妃香浴1" },
	{ "0x014B", "贵妃香浴2" },
	{ "0x014C", "贵妃香浴3" },
	{ "0x014D", "贵妃香浴4" },
	{ "0x014E", "贵妃香浴5" },
	{ "0x014F", "贵妃香浴6" },
	{ "0x0150", "贵妃香浴7" },
	{ "0x0151", "贵妃香浴8" },
	{ "0x0152", "灵儿服饰" },
	{ "0x0153", "浴灵儿" },
	{ "0x0154", "黑苗兵" },
	{ "0x0155", "刀黑苗兵" },
	{ "0x0156", "猎户" },
	{ "0x0157", "背弓箭猎户" },
	{ "0x0158", "被尸妖所伤腿持拐居民" },
	{ "0x0159", "被尸妖所伤臂坐居民" },
	{ "0x015A", "被尸妖所伤病倒居民" },
	{ "0x015B", "小女飞贼" },
	{ "0x015C", "持包姬三娘" },
	{ "0x015D", "姬三娘" },
	{ "0x015E", "女飞贼" },
	{ "0x015F", "石长老" },
	{ "0x0160", "唐钰之父？" },
	{ "0x0161", "林天南" },
	{ "0x0162", "药铺商人" },
	{ "0x0163", "百货商人1" },
	{ "0x0164", "智杖和尚" },
	{ "0x0165", "持刀智杖和尚" },
	{ "0x0166", "剑圣" },
	{ "0x0167", "洒扫和尚" },
	{ "0x0168", "担水和尚" },
	{ "0x0169", "李逍遥惊艳" },
	{ "0x016A", "五雷" },
	{ "0x016B", "御风灵儿" },
	{ "0x016C", "惊梦灵儿" },
	{ "0x016D", "灵儿" },
	{ "0x016E", "李赵合拥" },
	{ "0x016F", "姥姥上坟" },
	{ "0x0170", "磨刀师傅" },
	{ "0x0171", "黑猫" },
	{ "0x0172", "醉鬼" },
	{ "0x0173", "醉鬼1" },
	{ "0x0174", "锁妖塔底层漩涡" },
	{ "0x0175", "狗" },
	{ "0x0176", "叫狗" },
	{ "0x0177", "左面伏案柳媚娘" },
	{ "0x0178", "迷昏混混" },
	{ "0x0179", "迷昏无赖" },
	{ "0x017A", "迷昏流氓" },
	{ "0x017B", "睡案李逍遥" },
	{ "0x017C", "商人布包" },
	{ "0x017D", "紫金葫芦" },
	{ "0x017E", "坐堂扬州太守" },
	{ "0x017F", "香案" },
	{ "0x0180", "酒剑仙鲸吞" },
	{ "0x0181", "跪林月如" },
	{ "0x0182", "跪姬三娘" },
	{ "0x0183", "毒死珠宝商" },
	{ "0x0184", "老牛" },
	{ "0x0185", "大宝箱" },
	{ "0x0186", "挨板李逍遥" },
	{ "0x0187", "衙役" },
	{ "0x0188", "背面衙役" },
	{ "0x0189", "遭捆韩医仙" },
	{ "0x018A", "昏倒灵儿" },
	{ "0x018B", "渔具包" },
	{ "0x018C", "玉佛珠" },
	{ "0x018D", "原地逍遥" },
	{ "0x018E", "原地灵儿" },
	{ "0x018F", "原地阿奴" },
	{ "0x0190", "原地月如" },
	{ "0x0191", "刘家侍女" },
	{ "0x0192", "原地面南黄衣扑扇刘晋元" },
	{ "0x0193", "行走棕衣扑扇刘晋元" },
	{ "0x0194", "行走灰衣空手刘晋元" },
	{ "0x0195", "行走货真价实扑扇刘晋元" },
	{ "0x0196", "行走浅棕衣空手刘晋元" },
	{ "0x0197", "原地棕衣扑扇刘晋元" },
	{ "0x0198", "原地灰衣空手刘晋元" },
	{ "0x0199", "原地浅棕衣空手刘晋元" },
	{ "0x019A", "托盘小二" },
	{ "0x019B", "荷枪府兵" },
	{ "0x019C", "原地唐钰" },
	{ "0x019D", "原地磕头小石头" },
	{ "0x019E", "提棍衙役" },
	{ "0x019F", "坐床面西妓女.原地面北妓女" },
	{ "0x01A0", "莺莺夫人" },
	{ "0x01A1", "逍遥急看月如倒地?" },
	{ "0x01A2", "白苗女兵1" },
	{ "0x01A3", "白苗女兵2" },
	{ "0x01A4", "白苗女兵3" },
	{ "0x01A5", "白苗女兵4" },
	{ "0x01A6", "白苗女兵5" },
	{ "0x01A7", "白苗女兵6" },
	{ "0x01A8", "黑苗死兵1" },
	{ "0x01A9", "黑苗死兵2" },
	{ "0x01AA", "黑苗死兵3" },
	{ "0x01AB", "黑苗死兵4" },
	{ "0x01AC", "昏倒盖罗娇" },
	{ "0x01AD", "白苗死兵1" },
	{ "0x01AE", "白苗死兵2" },
	{ "0x01AF", "赤血毒焰" },
	{ "0x01B0", "石长老发威" },
	{ "0x01B1", "迷昏李逍遥" },
	{ "0x01B2", "迷昏林月如" },
	{ "0x01B3", "施法盖罗娇" },
	{ "0x01B4", "大轿" },
	{ "0x01B5", "掀轿" },
	{ "0x01B6", "原地盛装林月如" },
	{ "0x01B7", "舞娘" },
	{ "0x01B8", "乞丐" },
	{ "0x01B9", "乞丐1" },
	{ "0x01BA", "糖葫芦小贩" },
	{ "0x01BB", "白苗女兵" },
	{ "0x01BC", "剑圣御剑" },
	{ "0x01BD", "彩依原形" },
	{ "0x01BE", "侍女" },
	{ "0x01BF", "乞香蕉猴子" },
	{ "0x01C0", "跃阿奴" },
	{ "0x01C1", "卧病刘晋元" },
	{ "0x01C2", "侍夫彩依" },
	{ "0x01C3", "跌地刘晋元" },
	{ "0x01C4", "蠢道士燃符" },
	{ "0x01C5", "蠢道士被烧" },
	{ "0x01C6", "昏倒刘夫人" },
	{ "0x01C7", "昏倒侍女" },
	{ "0x01C8", "昏倒侍女1" },
	{ "0x01C9", "昏倒侍女2" },
	{ "0x01CA", "巨蜘蛛网" },
	{ "0x01CB", "拔剑林月如" },
	{ "0x01CC", "孽龙" },
	{ "0x01CD", "未见奇怪" },
	{ "0x01CE", "蘑菇怪" },
	{ "0x01CF", "未见树妖" },
	{ "0x01D0", "火妖" },
	{ "0x01D1", "灯笼" },
	{ "0x01D2", "黑衣道众" },
	{ "0x01D3", "未见奇怪" },
	{ "0x01D4", "草妖" },
	{ "0x01D5", "未见云怪" },
	{ "0x01D6", "公背婆.怪老儿" },
	{ "0x01D7", "火妖众" },
	{ "0x01D8", "蛇妖众" },
	{ "0x01D9", "蜂群" },
	{ "0x01DA", "尸妖众" },
	{ "0x01DB", "蜥蜴" },
	{ "0x01DC", "漂河酒剑仙" },
	{ "0x01DD", "大树妖" },
	{ "0x01DE", "火麒麟" },
	{ "0x01DF", "人蛇" },
	{ "0x01E0", "蜘蛛毒娘子" },
	{ "0x01E1", "雷蜘蛛" },
	{ "0x01E2", "腐尸" },
	{ "0x01E3", "天鬼皇?" },
	{ "0x01E4", "镇狱明王" },
	{ "0x01E5", "巨蛤蟆" },
	{ "0x01E6", "地裂魔兽" },
	{ "0x01E7", "酒剑仙飞剑斩妖" },
	{ "0x01E8", "蜘蛛" },
	{ "0x01E9", "彩依舍命救晋元" },
	{ "0x01EA", "血池鬼手" },
	{ "0x01EB", "锁妖塔巨铜门" },
	{ "0x01EC", "魔众" },
	{ "0x01ED", "未见魔眼" },
	{ "0x01EE", "熊妖" },
	{ "0x01EF", "小刑天" },
	{ "0x01F0", "巨灵神" },
	{ "0x01F1", "未见鬼众" },
	{ "0x01F2", "未见化蛇灵儿" },
	{ "0x01F3", "化蛇灵儿" },
	{ "0x01F4", "锁剑柱灵儿" },
	{ "0x01F5", "灰凤凰" },
	{ "0x01F6", "白蛇传" },
	{ "0x01F7", "未见剑圣直立御剑" },
	{ "0x01F8", "天书" },
	{ "0x01F9", "姜明遗体" },
	{ "0x01FA", "吸妖坛" },
	{ "0x01FB", "未见鬼众" },
	{ "0x01FC", "未见鬼众1" },
	{ "0x01FD", "未见鬼众2" },
	{ "0x01FE", "未见鬼众3" },
	{ "0x01FF", "逍遥救下灵儿" },
	{ "0x0200", "化蛇灵儿" },
	{ "0x0201", "白苗女" },
	{ "0x0202", "猩猩" },
	{ "0x0203", "月如遗体" },
	{ "0x0204", "月如幽魂" },
	{ "0x0205", "引魂灯" },
	{ "0x0206", "凤凰巢" },
	{ "0x0207", "香蕉树" },
	{ "0x0208", "逍遥跌死" },
	{ "0x0209", "阿奴救活逍遥" },
	{ "0x020A", "金翅凤凰" },
	{ "0x020B", "右门板" },
	{ "0x020C", "盘龙剑柱" },
	{ "0x020D", "巫后" },
	{ "0x020E", "青年姥姥" },
	{ "0x020F", "水月宫主" },
	{ "0x0210", "抱灵儿姥姥" },
	{ "0x0211", "逍遥跪拜" },
	{ "0x0212", "阿奴跪拜" },
	{ "0x0213", "水底逍遥" },
	{ "0x0214", "锁妖塔底逍遥" },
	{ "0x0215", "锁妖塔底月如" },
	{ "0x0216", "锁妖塔底化蛇灵儿" },
	{ "0x0217", "小李逍遥" },
	{ "0x0218", "小丁香兰" },
	{ "0x0219", "小丁秀兰" },
	{ "0x021A", "伤李逍遥" },
	{ "0x021B", "伤卧李逍遥" },
	{ "0x021C", "桃树" },
	{ "0x021D", "坠落李逍遥" },
	{ "0x021E", "南绍被捕汉人" },
	{ "0x021F", "南绍刽子手" },
	{ "0x0220", "南绍兵" },
	{ "0x0221", "南绍兵1" },
	{ "0x0222", "死南绍兵" },
	{ "0x0223", "死南绍兵1" },
	{ "0x0224", "杀红眼南绍兵" },
	{ "0x0225", "杀红眼南绍兵1" },
	{ "0x0226", "李逍遥抱子" },
	{ "0x0227", "李忆如" },
	{ "0x0228", "阿奴抱忆如" },
	{ "0x0229", "小灵儿" },
	{ "0x022A", "南绍校刀手" },
	{ "0x022B", "南绍被捕汉女" },
	{ "0x022C", "南绍被捕汉女1" },
	{ "0x022D", "南绍被捕汉人" },
	{ "0x022E", "南绍被捕汉童" },
	{ "0x022F", "南绍被捕汉女童" },
	{ "0x0230", "南绍被捕汉人" },
	{ "0x0231", "南绍被捕汉人" },
	{ "0x0232", "拜月教主" },
	{ "0x0233", "逍遥假扮苗人" },
	{ "0x0234", "巫王" },
	{ "0x0235", "坐巫王" },
	{ "0x0236", "左面白苗女兵" },
	{ "0x0237", "前面白苗女兵" },
	{ "0x0238", "逍遥护巫后" },
	{ "0x0239", "凤凰救驾" },
	{ "0x023A", "金翅凤凰" },
	{ "0x023B", "花屏" },
	{ "0x023C", "花屏" },
	{ "0x023D", "牢门" },
	{ "0x023E", "困巫后" },
	{ "0x023F", "行巫后" },
	{ "0x0240", "水中巫后" },
	{ "0x0241", "汉人头颅" },
	{ "0x0242", "汉人头颅载沉载浮" },
	{ "0x0243", "汉人尸首" },
	{ "0x0244", "汉人尸首1" },
	{ "0x0245", "汉人尸首2" },
	{ "0x0246", "水魔兽" },
	{ "0x0247", "水底拜月" },
	{ "0x0248", "水底逍遥" },
	{ "0x0249", "旋风" },
	{ "0x024A", "灭天之岚" },
	{ "0x024B", "火来" },
	{ "0x024C", "伤姥姥" },
	{ "0x024D", "抱娃妇人" },
	{ "0x024E", "巫后魂" },
	{ "0x024F", "蛤蟆" },
	{ "0x0250", "灵山碑" },
	{ "0x0251", "左面白苗女兵" },
	{ "0x0252", "前面白苗女兵" },
	{ "0x0253", "死白苗女童" },
	{ "0x0254", "老丈" },
	{ "0x0255", "右向黑苗兵" },
	{ "0x0256", "后向黑苗兵" },
	{ "0x0257", "右向苗人枪" },
	{ "0x0258", "后向苗人枪" },
	{ "0x0259", "顶盘子卖艺者" },
	{ "0x025A", "吞剑卖艺者" },
	{ "0x025B", "灵珠坛" },
	{ "0x025C", "水灵珠" },
	{ "0x025D", "左向舞苗女" },
	{ "0x025E", "右向舞苗女" },
	{ "0x025F", "李逍遥拥阿奴" },
	{ "0x0260", "阿奴枯坐" },
	{ "0x0261", "圣姑" },
	{ "0x0262", "雨" },
	{ "0x0263", "苗人刀" },
	{ "0x0264", "天蛇杖" },
	{ "0x0265", "逍遥乘升降梯" },
	{ "0x0266", "李赵奴乘升降梯" },
	{ "0x0267", "牢门" },
	{ "0x0268", "原地酒剑仙" },
	{ "0x0269", "左壁火" },
	{ "0x026A", "右壁火" },
	{ "0x026B", "篝火" },
	{ "0x026C", "铁棍魔兵" },
	{ "0x026D", "铁锤魔兵" },
	{ "0x026E", "前向伏案商旅" },
	{ "0x026F", "乘云仙兵" },
	{ "0x0270", "小雷公" },
	{ "0x0271", "蝎子" },
	{ "0x0272", "蚰蜒" },
	{ "0x0273", "耍酷逍遥" },
	{ "0x0274", "执铲李大婶" },
	{ "0x0275", "阿奴救灵儿" },
	{ "0x0276", "假巫王刺灵儿" },
	{ "0x0277", "灵儿倒地" },
	{ "0x0278", "假巫王现形" },
	{ "0x0279", "巨蝎" },
	{ "0x027A", "原地侍女" },
	{ "0x027B", "雪" },
	{ "0x027C", "麒麟折角" },
	{ "0xFFFF", "不变" }
};

static const CHAR StatusID[][iMessagesChildLen][16] = {
	{ "0x0000", "隐藏" },
	{ "0x0001", "飘浮" },
	{ "0x0002", "正常" },
	{ "0x0003", "完事" }
};

static const CHAR TeamMemberID[][iMessagesChildLen][16] = {
	{ "0x0000", "队伍角色1" },
	{ "0x0001", "队伍角色2" },
	{ "0x0002", "队伍角色3" }
};

static const CHAR TriggerMethodID[][iMessagesChildLen][32] = {
	{ "0x0000", "无法触发" },
	{ "0x0001", "近距离调查触发" },
	{ "0x0002", "中距离调查触发" },
	{ "0x0003", "远距离调查触发" },
	{ "0x0004", "近距离接触触发" },
	{ "0x0005", "中距离接触触发" },
	{ "0x0006", "远距离接触触发" },
	{ "0x0007", "超远距离接触触发" },
	{ "0x0008", "超特远距离接触触发" }
};

typedef struct tagSrciptMess {
	CHAR        lpSrcMessIndex[16];
	CHAR        lpSrcMessOpera[128];
	CHAR         szSrcMessOperand[3];
}SrciptMess;

static const SrciptMess strSrciptMessages[] = {
	{ "0x0000", "=========================================== " },
	// 独占脚本特别注意：0000处的整条0000指令，其作用为立刻停止执行；其他任何处的整条0000指令，副作用为将调用指令修改为0008脚本要修改到的地址。
	// 这就有一个问题，许多脚本都是不成功就跳转到0000的；结果顺便就把脚本流定在0000处，从此无效了。七大毒蛊就是吃了这个亏。暂定名0000bug。
	// 任何涉及跳转的独占脚本——不包括战斗脚本，它们的战时控制流是拔出来另算的——理论上都受此bug影响。
	// 自动脚本均为立刻自动执行。



	{ "0x0001", "停止执行，将调用地址替换为下一条命令" },
	// 自动脚本无
	// 实现了一下试试，发现根本就无需有也能处理。



	{ "0x0002", "停止执行，将调用地址替换为", { kScriptID, kWORD } },
	// NewScript Count(continues after Count replacements are made, 0=always replace)



	{ "0x0003", "跳转到脚本，参数三重复次数", { kScriptID, kWORD } },
	// Script Count
	// 自动脚本处理到跳转的第一条 独占脚本有实现，但还好没有跳到0000的，建议非战斗独占脚本在原引擎下不要这么用。



	{ "0x0004", "调用脚本，参数三重复次数", { kScriptID, kEventID } },
	// Script 调用者 未指定则为当前对象 脚本重入
	// 自动脚本处理完整个调用



	{ "0x0005", "清屏", { kBOOL, kWORD, kBOOL } },
	// 写屏方式? 延迟 若当前不在地图层，还原到地图层；否则重新生成画面，若参3非0，还要事先更新角色信息
	// 自动脚本无



	{ "0x0006", "几率继续，参二文档号或当前文档地址", { kWORD, kScriptID } },
	// 自动脚本处理到跳转处(若跳转)。若kScriptID为0，则本轮停止执行，下次从当前行重新掷盅判断。
	// 两个实现均0000bug免疫，作了特殊处理



	{ "0x0007", "开战", { kEnemyTeamID, kScriptID, kScriptID } },
	// 敌方队列 我方全灭脚本 我方逃跑脚本
	// EnemyTeam DefeatScript EscapeScript
	// 自动脚本无



	{ "0x0008", "将调用地址替换为下一条命令" },
	// 自动脚本无



	{ "0x0009", "空闲N循环", { kWORD, kBOOL, kBOOL } },
	// Time 是否触发事件 是否更新进主角步伐表格。
	// 独占脚本利用这N循环执行自动脚本
	// 自动脚本则N循环啥都不干。



	{ "0x000a", "选是则跳转", { kScriptID } },
	// 自动脚本无
	// 0000bug候选，但无0000调用



	{ "0x000b", "本对象向西行" },



	{ "0x000c", "本对象向北行" },



	{ "0x000d", "本对象向东行" },



	{ "0x000e", "本对象向南行" },



	{ "0x000f", "本对象转向,参数二置帧", { kDirectionID, kWORD } },
	// Direction Frame 方向为负时跳过方向的设置



	{ "0x0010", "本对象走到", { kWORD, kWORD, kWORD } },
	//  XBlock YBlock HalfBlock, no edge check 速度3



	{ "0x0011", "本对象互斥慢速走到", { kWORD, kWORD, kWORD } },
	//  XBlock YBlock HalfBlock, no edge check 速度2
	// 以上2指令不到目的地不执行下一条,重复执行本条，但本次执行终止。



	{ "0x0012", "相对移动对象", { kEventID, kWORD, kWORD } },
	// 



	{ "0x0013", "绝对移动对象", { kEventID, kWORD, kWORD } },
	// 



	{ "0x0014", "本对象置帧", { kWORD } },



	{ "0x0015", "设置队员方向和帧", { kDirectionID, kWORD, kTeamMemberID } },
	// Direction Frame# TeamMember



	{ "0x0016", "设置对象动作", { kEventID, kDirectionID, kWORD } },
	//  Object #WalkingFramesPerDirection CurrentFrame 
	// ObjectID==0->啥都不干,<0->当前对象,在当前图内图内设置，不在绝对设置。



	{ "0x0017", "设置部位属性", { kBodyPartID, kAttributeID, kSHORT } },



	{ "0x0018", "装备", { kBodyPartID, kWordID } },



	{ "0x0019", "增加属性", { kAttributeID, kSHORT, kCharacterID } },
	//  这里若ID<=0，则为当前对象



	{ "0x001a", "设置属性", { kAttributeID, kSHORT, kCharacterID } },
	// 属性 数值(战时情况下修改战像和合体法术直接修改战时数据结构) 人员/0->战时



	{ "0x001b", "HP回复", { kBOOL, kSHORT } },



	{ "0x001c", "MP回复", { kBOOL, kSHORT } },



	{ "0x001d", "HPMP回复", { kBOOL, kSHORT, kSHORT } },
	// ApplyToAll HPMP MP(if specified, arg2 becomes HP)
	// EXE中arg3根本未实现，只能HMP同增。



	{ "0x001e", "增加金钱", { kSHORT, kScriptID } },
	// Amount InsufficientMoneyScript



	{ "0x001f", "获得道具", { kWordID, kSHORT } },
	// Item Quantity 0同1



	{ "0x0020", "用去道具", { kWordID, kWORD, kScriptID } },
	// Item Quantity InsufficientScript
	// 包括装备中道具,若实在不够，按队伍序往下拆。



	{ "0x0021", "伤敌", { kBOOL, kSHORT } },



	{ "0x0022", "我方复活", { kBOOL, kWORD } },
	// ApplyToAll 复活清空毒、状态，状态残余回合数>999则不变



	{ "0x0023", "卸下装备", { kRoleID, kBodyPartID } },
	// 队伍第x人 BodyArmorPart (0 = all)



	{ "0x0024", "设置对象自动脚本", { kEventID, kScriptID } },
	//  参见脚本16



	{ "0x0025", "设置对象触发脚本", { kEventID, kScriptID } },
	//  同上



	{ "0x0026", "启动店铺", { kShopID } },



	{ "0x0027", "启动当铺" },



	{ "0x0028", "对敌下毒", { kBOOL, kWordID } },
	// ApplyToAll Poison 巫抗随机判断
	// 似乎蛊术没有对应的蛊物副作用？毒脚本重入



	{ "0x0029", "对我下毒", { kBOOL, kWordID } },
	// ApplyToAll Poison 毒抗随机判断.
	// 此处我方毒抗相当于敌方巫抗.那敌方毒抗捏？……毒脚本重入



	{ "0x002a", "敌方毒愈", { kBOOL, kWordID } },
	// ApplyToAll Poison



	{ "0x002b", "我方毒愈", { kBOOL, kWordID } },
	// ApplyToAll Poison



	{ "0x002c", "我方弱毒治愈", { kBOOL, kWORD } },
	// ApplyToAll PoisonLevel



	{ "0x002d", "设置我方状态", { kConditionID, kWORD } },
	//           Condition Rounds
	// 傀儡状态特殊设置——检测死未。不良状态若尚未终结就不设置；良好状态则设置到当前与欲设者之长者。



	{ "0x002e", "设置敌方状态", { kConditionID, kWORD, kScriptID } },
	// Condition Rounds FailureScript
	// 貌似只有不良状态；有巫抗随机判定。



	{ "0x002f", "我方消除状态", { kConditionID } },



	{ "0x0030", "属性百分比增长", { kAttributeID, kWORD, kCharacterID } },
	// Attribute PercentageChange Character
	// 若参三指定，则为队中该人。存储在额外位置。



	{ "0x0031", "本队员改变战斗形象", { kBattleSpriteID } },
	// 仅改变参数，重绘由例行函数执行。



	{ "0x0032", "战时/平时分派", { kScriptID, kScriptID } },
	//  LOST SCRIPT!!!
	// 调用时为战时执行前者，平时执行后者。



	{ "0x0033",	"灵壶收妖", { kScriptID } },
	// FailureScript



	{ "0x0034", "灵壶炼丹", { kScriptID } },
	// InsufficientEnergyScript
	// 清空……经验值？……写错地方了吧？



	{ "0x0035", "震动屏幕", { kWORD, kWORD } },
	// Time Grade?
	// 前者震荡时间/次数(奇数时震屏，许多函数都会调用，所以具体代表时间不明)，后者为震荡行数/等级。



	{ "0x0036", "设置动画", { kMovieID } },



	{ "0x0037", "播放动画帧", { kWORD, kWORD, kWORD } },
	// StartFrame StopFrame(0=play all) Speed



	{ "0x0038", "土遁", { kScriptID } },
	// FailureScript
	// 离开迷宫脚本是重入的；失败的话则直接把下一个执行的脚本设为失败脚本。凡失败/不足脚本均如此。



	{ "0x0039", "吸收HP", { kWORD } },
	// Amount 可敌对我亦可我对敌。敌无HP上限。



	{ "0x003a", "非BOSS战逃跑", { kScriptID } },
	// FailureScript



	{ "0x003b", "中间显示", { kWORD } },
	//  字体颜色



	{ "0x003c", "上部显示", { kFaceID, kWORD, kBOOL } },
	//  人物 字体颜色 IsPlayingMovie(是否显示角色肖像【该参数不为 0 则为显示，否则为不显示】)
	//  若无人物，字靠左；有的话往右挪。若3=ffff（动画），先备份屏幕。



	{ "0x003d", "下部显示", { kFaceID, kWORD, kBOOL } },
	//  人物 字体颜色 IsPlayingMovie 同上



	{ "0x003e", "框架显示", { kBOOL } },
	//  字体颜色



	{ "0x003f", "乘物低速驶到", { kWORD, kWORD, kWORD } },
	//  XYH
	// 调用方式同10,11
	// 随驾驶者移动视角
	// 检测事件触发
	// 不到目的地本脚本不停止执行。



	{ "0x0040", "设置对象触发方式", { kEventID, kTriggerMethodID } },
	// Object TriggerMethod 参见脚本16



	{ "0x0041", "术法无效" },
	//  仙术前序脚本失败，不再执行下去



	{ "0x0042", "我方使用法术", { kWordID, kWORD, kSHORT } },
	// 仙术 基本伤害 敌人序号(若为0或>5则为隐含，若<0则任选)



	{ "0x0043", "背景音乐", { kMusicID, kMusicParamID } },
	//  音乐号 播放参数



	{ "0x0044", "乘物中速行至", { kWORD, kWORD, kWORD } },
	//  参见3f。



	{ "0x0045", "设置战斗音乐", { kMusicID } },
	// Music



	{ "0x0046", "设置队员块位置", { kWORD, kWORD, kWORD } },
	//  XBlock YBlock HalfBlock 设置了一大堆相关数据结构……



	{ "0x0047", "播放音效", { kWORD } },



	{ "0048", "音效相关... " },
	//  LOST SCRIPT!!!问题是没弄明白干吗……



	{ "0x0049", "设置对象状态", { kEventID, kStatusID } },
	//  2=hero cannot walk over 参见16 ObjectID=0时，此指令等同nop



	{ "0x004a", "设置战场环境", { kPictureID } },
	// BattleField



	{ "0x004b", "我方逃跑后僵直", { kSHORT } },
	//  默认……10毫秒【原版这里可能是有个参数一控制隐藏时间的，缺省则默认为 15 ，单位：秒】



	{ "0x004c", "本对象追向主角", { kWORD, kWORD, kBOOL } },
	// 警戒范围默认8 追及速度默认4 kBoolean
	// 不进入警戒范围时，敌进行与我坐标不同的方向的随机运动。复杂，未看完
	// 是否允许当前事件在追逐时穿墙【该参数不为 0 则为允许，否则为不允许】



	{ "0x004d", "等待击键" },



	{ "0x004e", "调入最后存档" },



	{ "0x004f", "全屏泛红", { kWORD } },
	//  若<=0全屏像素&=0xf|=0x10即泛红
	//  若>0当前半球色彩全部覆盖为x--x+24色彩。
	//  该参数已被sdlpal废除



	{ "0x0050", "淡出", { kBOOL } },
	//  是否快速淡出



	{ "0x0051", "淡入", { kBOOL } },
	//  是否快速淡出



	{ "0x0052", "本对象匿迹", { kWORD } },
	// VanishTime 消失过渡时长



	{ "0x0053", "下次切换调色板变成日间" },



	{ "0x0054", "下次切换调色板变成夜间" },



	{ "0x0055", "习得仙术", { kWordID, kCharacterID } },
	// 0则当前队员 不作显示



	{ "0x0056", "丧失仙术", { kWordID, kCharacterID } },
	// 0则当前队员



	{ "0x0057", "多倍MP设为基本伤害", { kWordID, kWORD } },
	//  仙术 倍数 0则为8



	{ "0x0058", "物品不够则跳转", { kWordID, kSHORT, kScriptID } },
	// 道具ID 道具数量 道具不足则跳转到的地址
	// Item Quantity 0则1 Script
	// 0000bug候选，但无0000调用



	{ "0x0059", "转到场景", { kSceneID } },
	// 凡是这类复杂指令——可能触发大量脚本重入者，都是设置好下次循环再调入的标志。根据敌人追逐回合，游戏主循环大概是10hz。



	{ "0x005a", "本队员血减半" },
	//  仅用于无影毒



	{ "0x005b", "该敌人受限血减半", { kWORD } },
	//  减血上限



	{ "0x005c", "我方隐形", { kWORD } },
	// Rounds 至少一回合



	{ "0x005d", "若该队员未中此毒则跳转", { kWordID, kScriptID } },
	// 0000bug候选，但无0000调用



	{ "0x005e", "若该敌人未中此毒则跳转", { kWordID, kScriptID } },
	// 0000bug出现过



	{ "0x005f", "我方阵亡" },



	{ "0x0060", "敌方阵亡" },



	{ "0x0061", "若该队员未中毒则跳转", { kScriptID } },
	// 0000bug候选，但无0000调用



	{ "0x0062", "敌人停止追逐感应", { kWORD } },
	// Time



	{ "0x0063", "敌人追逐感应倍增", { kWORD } },
	// Time



	{ "0x0064", "若该敌HP高于该比例则跳转", { kWORD, kScriptID } },
	//  Percent至少是1% Script
	// 0000bug候选，但无0000调用



	{ "0x0065", "设置人物形象", { kRoleID, kSpriteID, kBOOL } },
	// Role(in data.3) Sprite Immediate 若不在战斗中，判断这个参数以决定是否立刻设置。



	{ "0x0066", "投掷武器", { kWordID, kWORD } },
	// 模拟法术 BaseDamage 武*int(rnd(4))+基本伤害存入arg2,然后执行模拟法术。



	{ "0x0067", "敌方使用法术", { kWordID, kWORD } },
	//  法 施术频率 敌只有一个法术位，每次该脚本改变之。频率同，默认100%。
	// ffff为啥都不干，0为普攻。



	{ "0x0068", "目标若为我方则跳转", { kScriptID } },
	// 0000bug出现过



	{ "0x0069", "敌人逃跑", { kBOOL } },
	// ApplyToAll 100%成功



	{ "0x006a", "偷窃", { kWORD } },
	//  成功概率 若是钱(0),每次只能偷到当前值/(2+rnd(1))
	// 物品则只能偷到一个。



	{ "0x006b", "吹开敌人", { kSHORT } },
	// Amount



	{ "0x006c", "对象一步走到", { kEventID, kSHORT, kSHORT } },
	//  Object XOffset YOffset, 使用NPC走动函数



	{ "0x006d", "设置场景脚本", { kSceneID, kScriptID, kScriptID } },
	// kSceneID EnterScript LeaveScript



	{ "0x006e", "主角一步走到", { kSHORT, kSHORT, kWORD } },
	// XOffset YOffset 图层?



	{ "0x006f", "与指定对象同步指定状态", { kEventID, kStatusID } },
	//  同步状态（将当前事件对象和（参数一）指定的对象的当前状态同步设置到（参数二）指定的状态）
	//  两扇门之间。



	{ "0x0070", "主角走到", { kWORD, kWORD, kWORD } },
	// XBlock YBlock HalfBlock 速度2
	// 其后因不小心删掉了原文件，所以对实现的评点丢掉了。



	{ "0x0071", "画面波动", { kWORD, kSHORT } },
	//  波动层次层次 画面波动幅度



	{ "0x0072", "更换对象形象", { kEventID, kSpriteID, kBOOL } },
	// (0则当前) mgo号 是否重建mgo映像 LOST SCRIPT!!!



	{ "0x0073", "泛金消散", { kWORD, kWORD } },
	//  每次消散耗时 消散次数（参数二已被sdlpal废弃）



	{ "0x0074", "我方有损耗则跳转", { kScriptID } },
	//  实现上混淆了队员与成员
	// 0000bug候选，但无0000调用



	{ "0x0075", "组队", { kCharacterID, kCharacterID, kCharacterID } },



	{ "0x0076", "显示图片", { kPictureID, kWORD } },
	// Picture 等待时间（显示图片的淡入速度）



	{ "0x0077", "停止音乐", { kWORD, kBOOL } },
	//  音乐渐渐消逝的过渡时长 是0则停止CD（参数二已被sdlpal废弃）
	//  停止正在播放的音乐，sdlpal只实现了直接淡入停止音乐
	//  fade?(求测***) 是0则停止CD



	{ "0x0078", "战后返回地图" },



	{ "0x0079", "若队中有主角则跳转", { kWordID, kScriptID } },
	// TeamMemberRoleID Script
	// 0000bug候选，但无0000调用



	{ "0x007a", "主角稍快走到", { kWORD, kWORD, kWORD } },
	// X Y Half 速度4



	{ "0x007b", "主角迅速走到", { kWORD, kWORD, kWORD } },
	// X Y Half 速度8



	{ "0x007c", "本对象互斥走到", { kWORD, kWORD, kWORD } },
	//  XBlock YBlock HalfBlock, no edge check 速度4



	{ "0x007d", "对象移动到", { kEventID, kSHORT, kSHORT } },
	//  Object XOffset YOffset



	{ "0x007e", "设置对象所在层", { kEventID, kSHORT } },
	//  Object Layer



	{ "0x007f", "移动视线", { kSHORT, kSHORT, kWORD } },
	//  X Y Times 若=ffff则XY为绝对块,>0则XY为相对像素,本身为循环次数。
	// 参数一 最终X轴偏移到的像素数 = 参数一 * 32    最后自动减了 160
	// 参数一 最终Y轴偏移到的像素数 = 参数一 * 16    最后自动减了 112
	// 参数三 过渡分帧时长，除以 10 并向上取整（个位不为零则十位直接进一），得到相对的秒数



	{ "0x0080", "日夜切换", { kBOOL } },
	// (false=低速, true=高速)



	{ "0x0081", "若活动对象不在目视指定范围内则跳转", { kEventID, kWORD, kScriptID } },
	//  若领队不在（参数一）指定的事件的触发范围内（参数二表示自动触发方式，必须面朝对象），则跳转到参数三指向的地址
	// 参数二更改对象触发方式为接触触发，最终触发参数 = 参数二 + 5，对应 TriggerMethodID 中的触发参数
	//  Object 工作距离.*32+10像素vs.dist(当前目视位置,对象位置) Script 要求对象状态在1以上。
	// 0000bug候选，但无0000调用



	{ "0x0082", "本对象跑到", { kWORD, kWORD, kWORD } },
	// XBlock YBlock HalfBlock



	{ "0x0083", "若对象不在指定范围内则跳转", { kEventID, kWORD, kScriptID } },
	// ObjectSprite MaxOffset FailureScript
	// 0000bug候选，调用方式不存在此问题



	{ "0x0084", "放置对象", { kEventID, kTriggerMethodID, kScriptID } },
	// Object TriggerMethod FailureScript若无则不进行障碍检测



	{ "0x0085", "暂停整个游戏循环一段时间，期间NPC和队员都无法进行任何操作", { kWORD } },



	{ "0x0086", "若装备着的该道具少于指定数量则跳转", { kWordID, kWORD, kScriptID } },
	//  道具ID 道具数量（sdlpal废弃参数，默认为1） 若无人装备此物则跳转
	//  InventoryItem 装备数 Script
	// 0000bug候选，但无0000调用



	{ "0x0087", "本对象原地漫步" },



	{ "0x0088", "耗费钱数设为基本伤害", { kWordID } },
	//  法术 默认用5000/2.5，不够用剩下的钱/2.5设



	{ "0x0089", "结束战斗", { kBattleResultID } },



	{ "0x008a", "下一战自动战斗" },



	{ "0x008b", "更换调色板", { kPaletteID } },



	{ "0x008c", "向指定色彩淡入", { kWORD, kBYTE, kBOOL } },
	// 颜色号.这之后的三个颜色将覆盖整个调色板. 每次淡入等待时间 是则反转淡入
	// 淡入0x3F次。



	{ "0x008d", "修行提升", { kWORD } },
	//  升级数据随机。



	{ "0x008e", "还原屏幕" },
	//  可以清掉所有文字对话框等等



	{ "0x008f", "金钱减半" },



	{ "0x0090", "设置RPG元素脚本", { kWordID, kScriptID, kWORD } },
	// EnemyName 脚本 脚本类型



	{ "0x0091", "若调用之敌非同类中首位则跳转", { kScriptID } },
	// 0000bug候选，但无0000调用



	{ "0x0092", "觉醒", { kCharacterID } },
	// 其实就是一个施法动作。



	{ "0x0093", "淡入淡出", { kSHORT } },
	// 速度
	// 正数时淡入，负数时淡出



	{ "0x0094", "若对象为指定状态则跳转", { kEventID, kStatusID, kScriptID } },
	// 0000bug候选，但无0000调用



	{ "0x0095", "若在该场景则跳转", { kSceneID, kScriptID } },
	// 0000bug候选，但无0000调用



	{ "0x0096", "决死行" },



	{ "0x0097", "乘物高速行至", { kWORD, kWORD, kWORD } },
	// 速度8



	{ "0x0098", "跟随人等", { kSpriteID, kSpriteID } },



	{ "0x0099", "改变场景对应地图", { kSceneID, kWORD } },
	// 场景号 地图号 若场景号<0，即为当前场景。



	{ "0x009a", "设置对象序列状态", { kEventID, kEventID, kStatusID } },
	// ObjFirst ObjLast ActivationState



	{ "0x009b", "淡入到当前图景", { kWORD, kPictureID, kWORD } },
	//  全部参数均已被sdlpal废弃
	//  过渡方式 欲过渡到的背景图像 过渡时长
	//  方式:0重绘1直接2淡入 ffff则生成 若淡入为分割



	{ "0x009c", "若敌方分身失败则跳转", { kWORD, kScriptID } },
	//  分身数量0=1 失败脚本 HP+参1等分(HP>1方可)，只有只剩下该敌人自己时方可分身
	// 0000bug免疫，作了特殊处理



	{ "0x009d", "若敌方复活失败则跳转", { kWORD, kScriptID } },
	//  0则全部复活,否则1个 不许超过Team中规定的个数。LOST SCRIPT!!!
	// 0000bug免疫，作了特殊处理



	{ "0x009e", "若敌方召唤失败则跳转", { kWordID, kSHORT, kScriptID } },
	// EnemyType<=0召唤同类 Number至少召唤一个 不许超过Team中规定的个数。
	// 0000bug免疫，作了特殊处理



	{ "0x009f", "敌方变身", { kWordID } },



	{ "0x00a0", "退出游戏" },



	{ "0x00a1", "更新我方位置及步伐" },
	//  主要用在程序行走方面，以免后来者找不着北……



	{ "0x00a2", "以下N句随机跳转", { kWORD } },



	{ "0x00a3", "播放CD音轨", { kCDID, kMusicID, kBOOL } },
	// 音轨号 等价RIX/MIDI号 未知



	{ "0x00a4", "卷动图片", { kPictureID, kSpriteID, kWORD } },
	// Picture <=0不调入 Speed



	{ "0x00a5", "淡入图片", { kPictureID, kSpriteID, kWORD } },



	{ "0x00a6", "以当前屏幕为底" },



	/*++ 98版：--*/


	{ "0x00a7", "物品说明" },



	/*++ HACK：--*/


	//{ "0x0105", "得到经验值"},


	/*++ 预留：--*/


	{ "0xffff", "显示对话", { kMessageID } }
	// ' '：单引号对中的内容以红色显示   1A
	// - -：减号对中的内容以青色文本显示 8D
	// "" ：双引号对中的内容以黄色显示   2D
	// (：表情，汗滴
	// )：表情，爱心
	// ~n：对话自动中断，不须按空格。n为文字显示完毕后，等待的时间
	// $n：文字显示速度，n越大，显示越慢（影响之后的所有文字显示，直至遇另一个$n或重新游戏而改变）
	// 自动脚本无
};

const static WORD wScriptMessageLen = sizeof(strSrciptMessages) / sizeof(strSrciptMessages[0]);
